wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/hc32f_m14x.h
typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCR0;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCR1;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCR2;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCR3;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCR4;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCR5;
    union
    {
        __IO uint8_t OCSR10;
        stc_timer4_ocsr10_field_t OCSR10_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint16_t OCER10;
        stc_timer4_ocer10_field_t OCER10_f;
    };
    union
    {
        __IO uint8_t OCSR32;
        stc_timer4_ocsr32_field_t OCSR32_f;
    };
    uint8_t RESERVED9[1];
    union
    {
        __IO uint16_t OCER32;
        stc_timer4_ocer32_field_t OCER32_f;
    };
    union
    {
        __IO uint8_t OCSR54;
        stc_timer4_ocsr54_field_t OCSR54_f;
    };
    uint8_t RESERVED11[1];
    union
    {
        __IO uint16_t OCER54;
        stc_timer4_ocer54_field_t OCER54_f;
    };
    union
    {
        __IO uint16_t OCMR0;
        stc_timer4_ocmr0_field_t OCMR0_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint32_t OCMR1;
        stc_timer4_ocmr1_field_t OCMR1_f;
    };
    union
    {
        __IO uint16_t OCMR2;
        stc_timer4_ocmr2_field_t OCMR2_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint32_t OCMR3;
        stc_timer4_ocmr3_field_t OCMR3_f;
    };
    union
    {
        __IO uint16_t OCMR4;
        stc_timer4_ocmr4_field_t OCMR4_f;
    };
    uint8_t RESERVED17[2];
    union
    {
        __IO uint32_t OCMR5;
        stc_timer4_ocmr5_field_t OCMR5_f;
    };
    uint8_t RESERVED18[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED19[2];
    __IO uint16_t CISR;
    union
    {
        __IO uint16_t CCSR;
        stc_timer4_ccsr_field_t CCSR_f;
    };
    union
    {
        __IO uint16_t CIMR;
        stc_timer4_cimr_field_t CIMR_f;
    };
    uint8_t RESERVED22[54];
    __IO uint16_t PFSR10;
    __IO uint16_t PDRA10;
    __IO uint16_t PDRB10;
    uint8_t RESERVED25[2];
    __IO uint16_t PFSR32;
    __IO uint16_t PDRA32;
    __IO uint16_t PDRB32;
    uint8_t RESERVED28[2];
    __IO uint16_t PFSR54;
    __IO uint16_t PDRA54;
    __IO uint16_t PDRB54;
    union
    {
        __IO uint8_t POCR10;
        stc_timer4_pocr10_field_t POCR10_f;
    };
    uint8_t RESERVED32[3];
    union
    {
        __IO uint8_t POCR32;
        stc_timer4_pocr32_field_t POCR32_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t POCR54;
        stc_timer4_pocr54_field_t POCR54_f;
    };
    uint8_t RESERVED34[3];
    union
    {
        __IO uint16_t RCSR;
        stc_timer4_rcsr_field_t RCSR_f;
    };
    uint8_t RESERVED35[12];
    __IO uint16_t ATVR0;
    uint8_t RESERVED36[2];
    __IO uint16_t ATVR1;
    uint8_t RESERVED37[2];
    __IO uint16_t ATVR2;
    uint8_t RESERVED38[2];
    __IO uint16_t ATVR3;
    uint8_t RESERVED39[2];
    __IO uint16_t ATVR4;
    uint8_t RESERVED40[2];
    __IO uint16_t ATVR5;
    union
    {
        __IO uint8_t ATCR0;
        stc_timer4_atcr0_field_t ATCR0_f;
    };
    union
    {
        __IO uint8_t ATER0;
        stc_timer4_ater0_field_t ATER0_f;
    };
    union
    {
        __IO uint8_t ATMR0;
        stc_timer4_atmr0_field_t ATMR0_f;
    };
    uint8_t RESERVED44[1];
    union
    {
        __IO uint8_t ATCR1;
        stc_timer4_atcr1_field_t ATCR1_f;
    };
    union
    {
        __IO uint8_t ATER1;
        stc_timer4_ater1_field_t ATER1_f;
    };
    union
    {
        __IO uint8_t ATMR1;
        stc_timer4_atmr1_field_t ATMR1_f;
    };
    uint8_t RESERVED47[1];
    union
    {
        __IO uint8_t ATCR2;
        stc_timer4_atcr2_field_t ATCR2_f;
    };
    union
    {
        __IO uint8_t ATER2;
        stc_timer4_ater2_field_t ATER2_f;
    };
    union
    {
        __IO uint8_t ATMR2;
        stc_timer4_atmr2_field_t ATMR2_f;
    };
    uint8_t RESERVED50[1];
    union
    {
        __IO uint8_t ATCR3;
        stc_timer4_atcr3_field_t ATCR3_f;
    };
    union
    {
        __IO uint8_t ATER3;
        stc_timer4_ater3_field_t ATER3_f;
    };
    union
    {
        __IO uint8_t ATMR3;
        stc_timer4_atmr3_field_t ATMR3_f;
    };
    uint8_t RESERVED53[1];
    union
    {
        __IO uint8_t ATCR4;
        stc_timer4_atcr4_field_t ATCR4_f;
    };
    union
    {
        __IO uint8_t ATER4;
        stc_timer4_ater4_field_t ATER4_f;
    };
    union
    {
        __IO uint8_t ATMR4;
        stc_timer4_atmr4_field_t ATMR4_f;
    };
    uint8_t RESERVED56[1];
    union
    {
        __IO uint8_t ATCR5;
        stc_timer4_atcr5_field_t ATCR5_f;
    };
    union
    {
        __IO uint8_t ATER5;
        stc_timer4_ater5_field_t ATER5_f;
    };
    union
    {
        __IO uint8_t ATMR5;
        stc_timer4_atmr5_field_t ATMR5_f;
    };
    uint8_t RESERVED59[17];
    union
    {
        __IO uint16_t ESCR;
        stc_timer4_escr_field_t ESCR_f;
    };
}M0P_TIMER4_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t UIDR0;
        stc_uid_uidr0_field_t UIDR0_f;
    };
    union
    {
        __IO uint32_t UIDR1;
        stc_uid_uidr1_field_t UIDR1_f;
    };
    union
    {
        __IO uint32_t UIDR2;
        stc_uid_uidr2_field_t UIDR2_f;
    };
}M0P_UID_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t VC_CTL1;
        stc_vc_vc_ctl1_field_t VC_CTL1_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint16_t VC_CTL2;
        stc_vc_vc_ctl2_field_t VC_CTL2_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t VC_CTL3;
        stc_vc_vc_ctl3_field_t VC_CTL3_f;
    };
}M0P_VC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t LVD1_SET;
        stc_wsunit_lvd1_set_field_t LVD1_SET_f;
    };
    union
    {
        __IO uint32_t LVD_INT_STR;
        stc_wsunit_lvd_int_str_field_t LVD_INT_STR_f;
    };
    union
    {
        __IO uint32_t LVD_CLR;
        stc_wsunit_lvd_clr_field_t LVD_CLR_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t LVD2_SET;
        stc_wsunit_lvd2_set_field_t LVD2_SET_f;
    };
    uint8_t RESERVED4[1772];
    union
    {
        __IO uint8_t BUR01;
        stc_wsunit_bur01_field_t BUR01_f;
    };
    union
    {
        __IO uint8_t BUR02;
        stc_wsunit_bur02_field_t BUR02_f;
    };
    union
    {
        __IO uint8_t BUR03;
        stc_wsunit_bur03_field_t BUR03_f;
    };
    union
    {
        __IO uint8_t BUR04;
        stc_wsunit_bur04_field_t BUR04_f;
    };
    union
    {
        __IO uint8_t BUR05;
        stc_wsunit_bur05_field_t BUR05_f;
    };
    union
    {
        __IO uint8_t BUR06;
        stc_wsunit_bur06_field_t BUR06_f;
    };
    union
    {
        __IO uint8_t BUR07;
        stc_wsunit_bur07_field_t BUR07_f;
    };
    union
    {
        __IO uint8_t BUR08;
        stc_wsunit_bur08_field_t BUR08_f;
    };
    union
    {
        __IO uint8_t BUR09;
        stc_wsunit_bur09_field_t BUR09_f;
    };
    union
    {
        __IO uint8_t BUR10;
        stc_wsunit_bur10_field_t BUR10_f;
    };
    union
    {
        __IO uint8_t BUR11;
        stc_wsunit_bur11_field_t BUR11_f;
    };
    union
    {
        __IO uint8_t BUR12;
        stc_wsunit_bur12_field_t BUR12_f;
    };
    union
    {
        __IO uint8_t BUR13;
        stc_wsunit_bur13_field_t BUR13_f;
    };
    union
    {
        __IO uint8_t BUR14;
        stc_wsunit_bur14_field_t BUR14_f;
    };
    union
    {
        __IO uint8_t BUR15;
        stc_wsunit_bur15_field_t BUR15_f;
    };
    union
    {
        __IO uint8_t BUR16;
        stc_wsunit_bur16_field_t BUR16_f;
    };
}M0P_WSUNIT_TypeDef;

#define M0P_FLASH_BASE        (0x00000000UL)                 /* Flash Base                             */
#define M0P_CM0P_BASE         (0xE0000000UL)                 /* CM0P Private                           */
#define M0P_PERIPH_BASE       (0x40000000UL)                 /* Peripheral Base                        */

#define M0P_FLASH_IF_BASE     (M0P_PERIPH_BASE + 0x00000UL)  /* Flash interface registers              */
#define M0P_UNIQUE_ID_BASE    (M0P_PERIPH_BASE + 0x00200UL)  /* Unique ID registers                    */
#define M0P_CLOCK_BASE        (M0P_PERIPH_BASE + 0x10000UL)  /* Clock and reset registers              */
#define M0P_HWWDT_BASE        (M0P_PERIPH_BASE + 0x11000UL)  /* Hardware watchdog registers            */
#define M0P_SWWDT_BASE        (M0P_PERIPH_BASE + 0x12000UL)  /* Software watchdog registers            */
#define M0P_DTIM1_BASE        (M0P_PERIPH_BASE + 0x15000UL)  /* Dual timer 1 registers                 */
#define M0P_DTIM2_BASE        (M0P_PERIPH_BASE + 0x15020UL)  /* Dual timer 2 registers                 */
#define M0P_TIME4_BASE        (M0P_PERIPH_BASE + 0x20000UL)  /* Timer 4 registers                      */
#define M0P_CT0_PPG_BASE      (M0P_PERIPH_BASE + 0x25000UL)  /* Composite Timer 0 PPG registers        */
#define M0P_CT0_PWM_BASE      (M0P_PERIPH_BASE + 0x25000UL)  /* Composite Timer 0 PWM registers        */
#define M0P_CT0_RT_BASE       (M0P_PERIPH_BASE + 0x25000UL)  /* Composite Timer 0 RT registers         */
#define M0P_CT0_PWC_BASE      (M0P_PERIPH_BASE + 0x25000UL)  /* Composite Timer 0 PWC registers        */
#define M0P_CT1_PPG_BASE      (M0P_PERIPH_BASE + 0x25040UL)  /* Composite Timer 1 PPG registers        */
#define M0P_CT1_PWM_BASE      (M0P_PERIPH_BASE + 0x25040UL)  /* Composite Timer 1 PWM registers        */
#define M0P_CT1_RT_BASE       (M0P_PERIPH_BASE + 0x25040UL)  /* Composite Timer 1 RT registers         */
#define M0P_CT1_PWC_BASE      (M0P_PERIPH_BASE + 0x25040UL)  /* Composite Timer 1 PWC registers        */
#define M0P_CT2_PPG_BASE      (M0P_PERIPH_BASE + 0x25080UL)  /* Composite Timer 2 PPG registers        */
#define M0P_CT2_PWM_BASE      (M0P_PERIPH_BASE + 0x25080UL)  /* Composite Timer 2 PWM registers        */
#define M0P_CT2_RT_BASE       (M0P_PERIPH_BASE + 0x25080UL)  /* Composite Timer 2 RT registers         */
#define M0P_CT2_PWC_BASE      (M0P_PERIPH_BASE + 0x25080UL)  /* Composite Timer 2 PWC registers        */
#define M0P_CT3_PPG_BASE      (M0P_PERIPH_BASE + 0x250C0UL)  /* Composite Timer 3 PPG registers        */
#define M0P_CT3_PWM_BASE      (M0P_PERIPH_BASE + 0x250C0UL)  /* Composite Timer 3 PWM registers        */
#define M0P_CT3_RT_BASE       (M0P_PERIPH_BASE + 0x250C0UL)  /* Composite Timer 3 RT registers         */
#define M0P_CT3_PWC_BASE      (M0P_PERIPH_BASE + 0x250C0UL)  /* Composite Timer 3 PWC registers        */
#define M0P_CTIOSEL03_BASE    (M0P_PERIPH_BASE + 0x25100UL)  /* Composite Timer I/O selector channel 0 - channel 3 registers */
#define M0P_CTSSSR_BASE       (M0P_PERIPH_BASE + 0x25F00UL)  /* Software based Simulation Startup (Composite Timer) register */
#define M0P_ADC0_BASE         (M0P_PERIPH_BASE + 0x27000UL)  /* 12-bit ADC unit 0 registers            */
#define M0P_OSC_BASE          (M0P_PERIPH_BASE + 0x2E000UL)  /* OSC control registers                  */
#define M0P_EXTINT_BASE       (M0P_PERIPH_BASE + 0x30000UL)  /* External interrupt registers           */
#define M0P_IRQC_BASE         (M0P_PERIPH_BASE + 0x31000UL)  /* Interrupt request read registers       */
#define M0P_LCDC_BASE         (M0P_PERIPH_BASE + 0x32000UL)  /* LCD Controller registers               */
#define M0P_GPIO_BASE         (M0P_PERIPH_BASE + 0x33000UL)  /* General purpose I/O registers          */
#define M0P_WSUNIT_BASE       (M0P_PERIPH_BASE + 0x35000UL)  /* WS Unit registers                      */
#define M0P_MSC4_UART_BASE    (M0P_PERIPH_BASE + 0x37000UL)  /* UART asynchronous channel 4 registers  */
#define M0P_MSC4_SPI_BASE     (M0P_PERIPH_BASE + 0x37000UL)  /* UART synchronous channel 4 registers   */
#define M0P_MSC4_I2C_BASE     (M0P_PERIPH_BASE + 0x37000UL)  /* I2C channel 4 registers                */
#define M0P_MSC5_UART_BASE    (M0P_PERIPH_BASE + 0x37100UL)  /* UART asynchronous channel 5 registers  */
#define M0P_MSC5_SPI_BASE     (M0P_PERIPH_BASE + 0x37100UL)  /* UART synchronous channel 5 registers   */
#define M0P_MSC5_I2C_BASE     (M0P_PERIPH_BASE + 0x37100UL)  /* I2C channel 5 registers                */
#define M0P_MSC6_UART_BASE    (M0P_PERIPH_BASE + 0x37200UL)  /* UART asynchronous channel 6 registers  */
#define M0P_MSC6_SPI_BASE     (M0P_PERIPH_BASE + 0x37200UL)  /* UART synchronous channel 6 registers   */
#define M0P_MSC6_I2C_BASE     (M0P_PERIPH_BASE + 0x37200UL)  /* I2C channel 6 registers                */
#define M0P_CLOCKCOUNTER_BASE (M0P_PERIPH_BASE + 0x3A000UL)  /* Clock counter registers                */
#define M0P_PARITY_BASE       (M0P_PERIPH_BASE + 0x3C000UL)  /* Parity check registers                 */
#define M0P_PCG_BASE          (M0P_PERIPH_BASE + 0x3C100UL)  /* Peripheral Clock Gating registers      */
#define M0P_VC_BASE           (M0P_PERIPH_BASE + 0x3C300UL)  /* Voltage comparator registers           */
#define M0P_OPA0_BASE         (M0P_PERIPH_BASE + 0x3C400UL)  /* Operation amplifier 0 registers        */
#define M0P_OPA1_BASE         (M0P_PERIPH_BASE + 0x3C480UL)  /* Operation amplifier 1 registers        */
#define M0P_DMAC_BASE         (M0P_PERIPH_BASE + 0x60000UL)  /* DMAC register                          */
#define M0P_MTBDWT_BASE       (0xF0001000UL)                 /* MTB-DWT registers                      */
#define M0P_FASTIO_BASE       (0xF8000000UL)                 /* Fast GPIO                              */

#define M0P_ADC                                ((M0P_ADC_TypeDef*)M0P_ADC0_BASE)
#define M0P_CLOCK                              ((M0P_CLOCK_TypeDef*)M0P_CLOCK_BASE)
#define M0P_CLOCK_COUNTER                      ((M0P_CLOCK_COUNTER_TypeDef*)M0P_CLOCKCOUNTER_BASE)
#define M0P_CTIOSEL03                          ((M0P_CTIOSEL03_TypeDef*)M0P_CTIOSEL03_BASE)
#define M0P_CTSSSR                             ((M0P_CTSSSR_TypeDef*)M0P_CTSSSR_BASE)
#define M0P_CT0_PPG                            ((M0P_CT_PPG_TypeDef*)M0P_CT0_PPG_BASE)
#define M0P_CT1_PPG                            ((M0P_CT_PPG_TypeDef*)M0P_CT1_PPG_BASE)
#define M0P_CT2_PPG                            ((M0P_CT_PPG_TypeDef*)M0P_CT2_PPG_BASE)
#define M0P_CT3_PPG                            ((M0P_CT_PPG_TypeDef*)M0P_CT3_PPG_BASE)
#define M0P_CT0_PWC                            ((M0P_CT_PWC_TypeDef*)M0P_CT0_PWC_BASE)
#define M0P_CT1_PWC                            ((M0P_CT_PWC_TypeDef*)M0P_CT1_PWC_BASE)
#define M0P_CT2_PWC                            ((M0P_CT_PWC_TypeDef*)M0P_CT2_PWC_BASE)
#define M0P_CT3_PWC                            ((M0P_CT_PWC_TypeDef*)M0P_CT3_PWC_BASE)
#define M0P_CT0_PWM                            ((M0P_CT_PWM_TypeDef*)M0P_CT0_PWM_BASE)
#define M0P_CT1_PWM                            ((M0P_CT_PWM_TypeDef*)M0P_CT1_PWM_BASE)
#define M0P_CT2_PWM                            ((M0P_CT_PWM_TypeDef*)M0P_CT2_PWM_BASE)
#define M0P_CT3_PWM                            ((M0P_CT_PWM_TypeDef*)M0P_CT3_PWM_BASE)
#define M0P_CT0_RT                             ((M0P_CT_RT_TypeDef*)M0P_CT0_RT_BASE)
#define M0P_CT1_RT                             ((M0P_CT_RT_TypeDef*)M0P_CT1_RT_BASE)
#define M0P_CT2_RT                             ((M0P_CT_RT_TypeDef*)M0P_CT2_RT_BASE)
#define M0P_CT3_RT                             ((M0P_CT_RT_TypeDef*)M0P_CT3_RT_BASE)
#define M0P_DMAC                               ((M0P_DMAC_TypeDef*)M0P_DMAC_BASE)
#define M0P_DTIM1                              ((M0P_DTIM_TypeDef*)M0P_DTIM1_BASE)
#define M0P_DTIM2                              ((M0P_DTIM_TypeDef*)M0P_DTIM2_BASE)
#define M0P_EXTINT                             ((M0P_EXTINT_TypeDef*)M0P_EXTINT_BASE)
#define M0P_FASTIO                             ((M0P_FASTIO_TypeDef*)M0P_FASTIO_BASE)
#define M0P_FLASH_IF                           ((M0P_FLASH_IF_TypeDef*)M0P_FLASH_IF_BASE)
#define M0P_GPIO                               ((M0P_GPIO_TypeDef*)M0P_GPIO_BASE)
#define M0P_HWWDT                              ((M0P_HWWDT_TypeDef*)M0P_HWWDT_BASE)
#define M0P_IRQC                               ((M0P_IRQC_TypeDef*)M0P_IRQC_BASE)
#define M0P_LCDC                               ((M0P_LCDC_TypeDef*)M0P_LCDC_BASE)
#define M0P_MSC4_I2C                           ((M0P_MSC_I2C_TypeDef*)M0P_MSC4_I2C_BASE)
#define M0P_MSC5_I2C                           ((M0P_MSC_I2C_TypeDef*)M0P_MSC5_I2C_BASE)
#define M0P_MSC6_I2C                           ((M0P_MSC_I2C_TypeDef*)M0P_MSC6_I2C_BASE)
#define M0P_MSC4_SPI                           ((M0P_MSC_SPI_TypeDef*)M0P_MSC4_SPI_BASE)
#define M0P_MSC5_SPI                           ((M0P_MSC_SPI_TypeDef*)M0P_MSC5_SPI_BASE)
#define M0P_MSC6_SPI                           ((M0P_MSC_SPI_TypeDef*)M0P_MSC6_SPI_BASE)
#define M0P_MSC4_UART                          ((M0P_MSC_UART_TypeDef*)M0P_MSC4_UART_BASE)
#define M0P_MSC5_UART                          ((M0P_MSC_UART_TypeDef*)M0P_MSC5_UART_BASE)
#define M0P_MSC6_UART                          ((M0P_MSC_UART_TypeDef*)M0P_MSC6_UART_BASE)
#define M0P_MTB_DWT                            ((M0P_MTB_DWT_TypeDef*)M0P_MTBDWT_BASE)
#define M0P_OPA0                               ((M0P_OPA_TypeDef*)M0P_OPA0_BASE)
#define M0P_OPA1                               ((M0P_OPA_TypeDef*)M0P_OPA1_BASE)
#define M0P_OSC_CTL                            ((M0P_OSC_CTL_TypeDef*)M0P_OSC_BASE)
#define M0P_PARITY                             ((M0P_PARITY_TypeDef*)M0P_PARITY_BASE)
#define M0P_PCG                                ((M0P_PCG_TypeDef*)M0P_PCG_BASE)
#define M0P_SWWDT                              ((M0P_SWWDT_TypeDef*)M0P_SWWDT_BASE)
#define M0P_TIMER4                             ((M0P_TIMER4_TypeDef*)M0P_TIME4_BASE)
#define M0P_UID                                ((M0P_UID_TypeDef*)M0P_UNIQUE_ID_BASE)
#define M0P_VC                                 ((M0P_VC_TypeDef*)M0P_VC_BASE)
#define M0P_WSUNIT                             ((M0P_WSUNIT_TypeDef*)M0P_WSUNIT_BASE)


