wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/hc32f_m14x.h
#define bM0P_GPIO_FN_SEL02_TIOA2E0                      *((volatile unsigned int*)(0x4266C148UL))
#define bM0P_GPIO_FN_SEL02_TIOA2E1                      *((volatile unsigned int*)(0x4266C14CUL))
#define bM0P_GPIO_FN_SEL02_TIOB2S0                      *((volatile unsigned int*)(0x4266C150UL))
#define bM0P_GPIO_FN_SEL02_TIOB2S1                      *((volatile unsigned int*)(0x4266C154UL))
#define bM0P_GPIO_FN_SEL02_TIOB2S2                      *((volatile unsigned int*)(0x4266C158UL))
#define bM0P_GPIO_FN_SEL02_TIOA3S0                      *((volatile unsigned int*)(0x4266C160UL))
#define bM0P_GPIO_FN_SEL02_TIOA3S1                      *((volatile unsigned int*)(0x4266C164UL))
#define bM0P_GPIO_FN_SEL02_TIOA3E0                      *((volatile unsigned int*)(0x4266C168UL))
#define bM0P_GPIO_FN_SEL02_TIOA3E1                      *((volatile unsigned int*)(0x4266C16CUL))
#define bM0P_GPIO_FN_SEL02_TIOB3S0                      *((volatile unsigned int*)(0x4266C170UL))
#define bM0P_GPIO_FN_SEL02_TIOB3S1                      *((volatile unsigned int*)(0x4266C174UL))
#define bM0P_GPIO_FN_SEL04_EINT00S0                     *((volatile unsigned int*)(0x4266C200UL))
#define bM0P_GPIO_FN_SEL04_EINT00S1                     *((volatile unsigned int*)(0x4266C204UL))
#define bM0P_GPIO_FN_SEL04_EINT01S0                     *((volatile unsigned int*)(0x4266C208UL))
#define bM0P_GPIO_FN_SEL04_EINT01S1                     *((volatile unsigned int*)(0x4266C20CUL))
#define bM0P_GPIO_FN_SEL04_EINT02S0                     *((volatile unsigned int*)(0x4266C210UL))
#define bM0P_GPIO_FN_SEL04_EINT02S1                     *((volatile unsigned int*)(0x4266C214UL))
#define bM0P_GPIO_FN_SEL04_EINT03S0                     *((volatile unsigned int*)(0x4266C218UL))
#define bM0P_GPIO_FN_SEL04_EINT03S1                     *((volatile unsigned int*)(0x4266C21CUL))
#define bM0P_GPIO_FN_SEL04_EINT04S0                     *((volatile unsigned int*)(0x4266C220UL))
#define bM0P_GPIO_FN_SEL04_EINT04S1                     *((volatile unsigned int*)(0x4266C224UL))
#define bM0P_GPIO_FN_SEL04_EINT05S0                     *((volatile unsigned int*)(0x4266C228UL))
#define bM0P_GPIO_FN_SEL04_EINT05S1                     *((volatile unsigned int*)(0x4266C22CUL))
#define bM0P_GPIO_FN_SEL04_EINT06S0                     *((volatile unsigned int*)(0x4266C230UL))
#define bM0P_GPIO_FN_SEL04_EINT06S1                     *((volatile unsigned int*)(0x4266C234UL))
#define bM0P_GPIO_FN_SEL04_EINT07S0                     *((volatile unsigned int*)(0x4266C238UL))
#define bM0P_GPIO_FN_SEL04_EINT07S1                     *((volatile unsigned int*)(0x4266C23CUL))
#define bM0P_GPIO_FN_SEL04_EINT08S0                     *((volatile unsigned int*)(0x4266C240UL))
#define bM0P_GPIO_FN_SEL04_EINT08S1                     *((volatile unsigned int*)(0x4266C244UL))
#define bM0P_GPIO_FN_SEL04_EINT09S0                     *((volatile unsigned int*)(0x4266C248UL))
#define bM0P_GPIO_FN_SEL04_EINT09S1                     *((volatile unsigned int*)(0x4266C24CUL))
#define bM0P_GPIO_FN_SEL04_EINT10S0                     *((volatile unsigned int*)(0x4266C250UL))
#define bM0P_GPIO_FN_SEL04_EINT10S1                     *((volatile unsigned int*)(0x4266C254UL))
#define bM0P_GPIO_FN_SEL04_EINT11S0                     *((volatile unsigned int*)(0x4266C258UL))
#define bM0P_GPIO_FN_SEL04_EINT11S1                     *((volatile unsigned int*)(0x4266C25CUL))
#define bM0P_GPIO_FN_SEL04_EINT12S0                     *((volatile unsigned int*)(0x4266C260UL))
#define bM0P_GPIO_FN_SEL04_EINT12S1                     *((volatile unsigned int*)(0x4266C264UL))
#define bM0P_GPIO_FN_SEL04_EINT13S0                     *((volatile unsigned int*)(0x4266C268UL))
#define bM0P_GPIO_FN_SEL04_EINT13S1                     *((volatile unsigned int*)(0x4266C26CUL))
#define bM0P_GPIO_FN_SEL04_EINT14S0                     *((volatile unsigned int*)(0x4266C270UL))
#define bM0P_GPIO_FN_SEL04_EINT14S1                     *((volatile unsigned int*)(0x4266C274UL))
#define bM0P_GPIO_FN_SEL04_EINT15S0                     *((volatile unsigned int*)(0x4266C278UL))
#define bM0P_GPIO_FN_SEL04_EINT15S1                     *((volatile unsigned int*)(0x4266C27CUL))
#define bM0P_GPIO_FN_SEL07_RTS4E0                       *((volatile unsigned int*)(0x4266C380UL))
#define bM0P_GPIO_FN_SEL07_RTS4E1                       *((volatile unsigned int*)(0x4266C384UL))
#define bM0P_GPIO_FN_SEL07_CTS4S0                       *((volatile unsigned int*)(0x4266C388UL))
#define bM0P_GPIO_FN_SEL07_CTS4S1                       *((volatile unsigned int*)(0x4266C38CUL))
#define bM0P_GPIO_FN_SEL07_SIN4S0                       *((volatile unsigned int*)(0x4266C390UL))
#define bM0P_GPIO_FN_SEL07_SIN4S1                       *((volatile unsigned int*)(0x4266C394UL))
#define bM0P_GPIO_FN_SEL07_SOT4B0                       *((volatile unsigned int*)(0x4266C398UL))
#define bM0P_GPIO_FN_SEL07_SOT4B1                       *((volatile unsigned int*)(0x4266C39CUL))
#define bM0P_GPIO_FN_SEL07_SCK4B0                       *((volatile unsigned int*)(0x4266C3A0UL))
#define bM0P_GPIO_FN_SEL07_SCK4B1                       *((volatile unsigned int*)(0x4266C3A4UL))
#define bM0P_GPIO_FN_SEL07_SCS40B0                      *((volatile unsigned int*)(0x4266C3A8UL))
#define bM0P_GPIO_FN_SEL07_SCS40B1                      *((volatile unsigned int*)(0x4266C3ACUL))
#define bM0P_GPIO_FN_SEL07_SCS41E0                      *((volatile unsigned int*)(0x4266C3B0UL))
#define bM0P_GPIO_FN_SEL07_SCS41E1                      *((volatile unsigned int*)(0x4266C3B4UL))
#define bM0P_GPIO_FN_SEL07_SIN5S0                       *((volatile unsigned int*)(0x4266C3D0UL))
#define bM0P_GPIO_FN_SEL07_SIN5S1                       *((volatile unsigned int*)(0x4266C3D4UL))
#define bM0P_GPIO_FN_SEL07_SOT5B0                       *((volatile unsigned int*)(0x4266C3D8UL))
#define bM0P_GPIO_FN_SEL07_SOT5B1                       *((volatile unsigned int*)(0x4266C3DCUL))
#define bM0P_GPIO_FN_SEL07_SCK5B0                       *((volatile unsigned int*)(0x4266C3E0UL))
#define bM0P_GPIO_FN_SEL07_SCK5B1                       *((volatile unsigned int*)(0x4266C3E4UL))
#define bM0P_GPIO_FN_SEL07_SCS50B0                      *((volatile unsigned int*)(0x4266C3E8UL))
#define bM0P_GPIO_FN_SEL07_SCS50B1                      *((volatile unsigned int*)(0x4266C3ECUL))
#define bM0P_GPIO_FN_SEL08_RTS6E0                       *((volatile unsigned int*)(0x4266C400UL))
#define bM0P_GPIO_FN_SEL08_RTS6E1                       *((volatile unsigned int*)(0x4266C404UL))
#define bM0P_GPIO_FN_SEL08_CTS6S0                       *((volatile unsigned int*)(0x4266C408UL))
#define bM0P_GPIO_FN_SEL08_CTS6S1                       *((volatile unsigned int*)(0x4266C40CUL))
#define bM0P_GPIO_FN_SEL08_SIN6S0                       *((volatile unsigned int*)(0x4266C410UL))
#define bM0P_GPIO_FN_SEL08_SIN6S1                       *((volatile unsigned int*)(0x4266C414UL))
#define bM0P_GPIO_FN_SEL08_SOT6B0                       *((volatile unsigned int*)(0x4266C418UL))
#define bM0P_GPIO_FN_SEL08_SOT6B1                       *((volatile unsigned int*)(0x4266C41CUL))
#define bM0P_GPIO_FN_SEL08_SCK6B0                       *((volatile unsigned int*)(0x4266C420UL))
#define bM0P_GPIO_FN_SEL08_SCK6B1                       *((volatile unsigned int*)(0x4266C424UL))
#define bM0P_GPIO_FN_SEL08_SCS60B0                      *((volatile unsigned int*)(0x4266C428UL))
#define bM0P_GPIO_FN_SEL08_SCS60B1                      *((volatile unsigned int*)(0x4266C42CUL))
#define bM0P_GPIO_FN_SEL08_SCS61E0                      *((volatile unsigned int*)(0x4266C430UL))
#define bM0P_GPIO_FN_SEL08_SCS61E1                      *((volatile unsigned int*)(0x4266C434UL))
#define bM0P_GPIO_FN_SEL08_SCS62E0                      *((volatile unsigned int*)(0x4266C438UL))
#define bM0P_GPIO_FN_SEL08_SCS62E1                      *((volatile unsigned int*)(0x4266C43CUL))
#define bM0P_GPIO_FN_SEL09_VCOE0                        *((volatile unsigned int*)(0x4266C480UL))
#define bM0P_GPIO_FN_SEL09_VCOE1                        *((volatile unsigned int*)(0x4266C484UL))
#define bM0P_GPIO_FN_SEL09_ADTGS                        *((volatile unsigned int*)(0x4266C4E0UL))
#define bM0P_GPIO_ODR0_P00                              *((volatile unsigned int*)(0x4266E000UL))
#define bM0P_GPIO_ODR0_P01                              *((volatile unsigned int*)(0x4266E004UL))
#define bM0P_GPIO_ODR0_P02                              *((volatile unsigned int*)(0x4266E008UL))
#define bM0P_GPIO_ODR0_P03                              *((volatile unsigned int*)(0x4266E00CUL))
#define bM0P_GPIO_ODR0_P04                              *((volatile unsigned int*)(0x4266E010UL))
#define bM0P_GPIO_ODR0_P05                              *((volatile unsigned int*)(0x4266E014UL))
#define bM0P_GPIO_ODR0_P06                              *((volatile unsigned int*)(0x4266E018UL))
#define bM0P_GPIO_ODR0_P07                              *((volatile unsigned int*)(0x4266E01CUL))
#define bM0P_GPIO_ODR1_P10                              *((volatile unsigned int*)(0x4266E080UL))
#define bM0P_GPIO_ODR1_P11                              *((volatile unsigned int*)(0x4266E084UL))
#define bM0P_GPIO_ODR1_P12                              *((volatile unsigned int*)(0x4266E088UL))
#define bM0P_GPIO_ODR1_P13                              *((volatile unsigned int*)(0x4266E08CUL))
#define bM0P_GPIO_ODR1_P14                              *((volatile unsigned int*)(0x4266E090UL))
#define bM0P_GPIO_ODR1_P15                              *((volatile unsigned int*)(0x4266E094UL))
#define bM0P_GPIO_ODR1_P16                              *((volatile unsigned int*)(0x4266E098UL))
#define bM0P_GPIO_ODR2_P20                              *((volatile unsigned int*)(0x4266E100UL))
#define bM0P_GPIO_ODR2_P21                              *((volatile unsigned int*)(0x4266E104UL))
#define bM0P_GPIO_ODR2_P22                              *((volatile unsigned int*)(0x4266E108UL))
#define bM0P_GPIO_ODR2_P23                              *((volatile unsigned int*)(0x4266E10CUL))
#define bM0P_GPIO_ODR2_P24                              *((volatile unsigned int*)(0x4266E110UL))
#define bM0P_GPIO_ODR2_P25                              *((volatile unsigned int*)(0x4266E114UL))
#define bM0P_GPIO_ODR2_P26                              *((volatile unsigned int*)(0x4266E118UL))
#define bM0P_GPIO_ODR2_P27                              *((volatile unsigned int*)(0x4266E11CUL))
#define bM0P_GPIO_ODR3_P30                              *((volatile unsigned int*)(0x4266E180UL))
#define bM0P_GPIO_ODR3_P31                              *((volatile unsigned int*)(0x4266E184UL))
#define bM0P_GPIO_ODR3_P32                              *((volatile unsigned int*)(0x4266E188UL))
#define bM0P_GPIO_ODR4_P40                              *((volatile unsigned int*)(0x4266E200UL))
#define bM0P_GPIO_ODR4_P41                              *((volatile unsigned int*)(0x4266E204UL))
#define bM0P_GPIO_ODR4_P42                              *((volatile unsigned int*)(0x4266E208UL))
#define bM0P_GPIO_ODR4_P43                              *((volatile unsigned int*)(0x4266E20CUL))
#define bM0P_GPIO_ODR4_P44                              *((volatile unsigned int*)(0x4266E210UL))
#define bM0P_GPIO_ODR4_P45                              *((volatile unsigned int*)(0x4266E214UL))
#define bM0P_GPIO_ODR4_P46                              *((volatile unsigned int*)(0x4266E218UL))
#define bM0P_GPIO_ODR4_P47                              *((volatile unsigned int*)(0x4266E21CUL))
#define bM0P_GPIO_ODR5_P50                              *((volatile unsigned int*)(0x4266E280UL))
#define bM0P_GPIO_ODR5_P51                              *((volatile unsigned int*)(0x4266E284UL))
#define bM0P_GPIO_ODR5_P52                              *((volatile unsigned int*)(0x4266E288UL))
#define bM0P_GPIO_ODR5_P53                              *((volatile unsigned int*)(0x4266E28CUL))
#define bM0P_GPIO_ODR5_P54                              *((volatile unsigned int*)(0x4266E290UL))
#define bM0P_GPIO_ODR5_P55                              *((volatile unsigned int*)(0x4266E294UL))
#define bM0P_GPIO_ODR6_P60                              *((volatile unsigned int*)(0x4266E300UL))
#define bM0P_GPIO_ODR6_P61                              *((volatile unsigned int*)(0x4266E304UL))
#define bM0P_GPIO_ODR6_P62                              *((volatile unsigned int*)(0x4266E308UL))
#define bM0P_GPIO_ODR6_P63                              *((volatile unsigned int*)(0x4266E30CUL))
#define bM0P_GPIO_ODR6_P64                              *((volatile unsigned int*)(0x4266E310UL))
#define bM0P_GPIO_ODR6_P65                              *((volatile unsigned int*)(0x4266E314UL))
#define bM0P_GPIO_ODR6_P66                              *((volatile unsigned int*)(0x4266E318UL))
#define bM0P_GPIO_ODR6_P67                              *((volatile unsigned int*)(0x4266E31CUL))
#define bM0P_GPIO_ODR7_P70                              *((volatile unsigned int*)(0x4266E380UL))
#define bM0P_GPIO_ODR7_P71                              *((volatile unsigned int*)(0x4266E384UL))
#define bM0P_GPIO_ODR7_P72                              *((volatile unsigned int*)(0x4266E388UL))
#define bM0P_GPIO_ODR7_P73                              *((volatile unsigned int*)(0x4266E38CUL))
#define bM0P_GPIO_ODR7_P74                              *((volatile unsigned int*)(0x4266E390UL))
#define bM0P_GPIO_ODR7_P75                              *((volatile unsigned int*)(0x4266E394UL))
#define bM0P_GPIO_ODR7_P76                              *((volatile unsigned int*)(0x4266E398UL))
#define bM0P_GPIO_FSETE0_P00                            *((volatile unsigned int*)(0x42672000UL))
#define bM0P_GPIO_FSETE0_P01                            *((volatile unsigned int*)(0x42672004UL))
#define bM0P_GPIO_FSETE0_P02                            *((volatile unsigned int*)(0x42672008UL))
#define bM0P_GPIO_FSETE0_P03                            *((volatile unsigned int*)(0x4267200CUL))
#define bM0P_GPIO_FSETE0_P04                            *((volatile unsigned int*)(0x42672010UL))
#define bM0P_GPIO_FSETE0_P05                            *((volatile unsigned int*)(0x42672014UL))
#define bM0P_GPIO_FSETE0_P06                            *((volatile unsigned int*)(0x42672018UL))
#define bM0P_GPIO_FSETE0_P07                            *((volatile unsigned int*)(0x4267201CUL))
#define bM0P_GPIO_FSETE1_P10                            *((volatile unsigned int*)(0x42672080UL))
#define bM0P_GPIO_FSETE1_P11                            *((volatile unsigned int*)(0x42672084UL))
#define bM0P_GPIO_FSETE1_P12                            *((volatile unsigned int*)(0x42672088UL))
#define bM0P_GPIO_FSETE1_P13                            *((volatile unsigned int*)(0x4267208CUL))
#define bM0P_GPIO_FSETE1_P14                            *((volatile unsigned int*)(0x42672090UL))
#define bM0P_GPIO_FSETE1_P15                            *((volatile unsigned int*)(0x42672094UL))
#define bM0P_GPIO_FSETE1_P16                            *((volatile unsigned int*)(0x42672098UL))
#define bM0P_GPIO_FSETE2_P20                            *((volatile unsigned int*)(0x42672100UL))
#define bM0P_GPIO_FSETE2_P21                            *((volatile unsigned int*)(0x42672104UL))
#define bM0P_GPIO_FSETE2_P22                            *((volatile unsigned int*)(0x42672108UL))
#define bM0P_GPIO_FSETE2_P23                            *((volatile unsigned int*)(0x4267210CUL))
#define bM0P_GPIO_FSETE2_P24                            *((volatile unsigned int*)(0x42672110UL))
#define bM0P_GPIO_FSETE2_P25                            *((volatile unsigned int*)(0x42672114UL))
#define bM0P_GPIO_FSETE2_P26                            *((volatile unsigned int*)(0x42672118UL))
#define bM0P_GPIO_FSETE2_P27                            *((volatile unsigned int*)(0x4267211CUL))
#define bM0P_GPIO_FSETE3_P30                            *((volatile unsigned int*)(0x42672180UL))
#define bM0P_GPIO_FSETE3_P31                            *((volatile unsigned int*)(0x42672184UL))
#define bM0P_GPIO_FSETE3_P32                            *((volatile unsigned int*)(0x42672188UL))
#define bM0P_GPIO_FSETE4_P40                            *((volatile unsigned int*)(0x42672200UL))
#define bM0P_GPIO_FSETE4_P41                            *((volatile unsigned int*)(0x42672204UL))
#define bM0P_GPIO_FSETE4_P42                            *((volatile unsigned int*)(0x42672208UL))
#define bM0P_GPIO_FSETE4_P43                            *((volatile unsigned int*)(0x4267220CUL))
#define bM0P_GPIO_FSETE4_P44                            *((volatile unsigned int*)(0x42672210UL))
#define bM0P_GPIO_FSETE4_P45                            *((volatile unsigned int*)(0x42672214UL))
#define bM0P_GPIO_FSETE4_P46                            *((volatile unsigned int*)(0x42672218UL))
#define bM0P_GPIO_FSETE4_P47                            *((volatile unsigned int*)(0x4267221CUL))
#define bM0P_GPIO_FSETE5_P50                            *((volatile unsigned int*)(0x42672280UL))
#define bM0P_GPIO_FSETE5_P51                            *((volatile unsigned int*)(0x42672284UL))
#define bM0P_GPIO_FSETE5_P52                            *((volatile unsigned int*)(0x42672288UL))
#define bM0P_GPIO_FSETE5_P53                            *((volatile unsigned int*)(0x4267228CUL))
#define bM0P_GPIO_FSETE5_P54                            *((volatile unsigned int*)(0x42672290UL))
#define bM0P_GPIO_FSETE5_P55                            *((volatile unsigned int*)(0x42672294UL))
#define bM0P_GPIO_FSETE6_P60                            *((volatile unsigned int*)(0x42672300UL))
#define bM0P_GPIO_FSETE6_P61                            *((volatile unsigned int*)(0x42672304UL))
#define bM0P_GPIO_FSETE6_P62                            *((volatile unsigned int*)(0x42672308UL))
#define bM0P_GPIO_FSETE6_P63                            *((volatile unsigned int*)(0x4267230CUL))
#define bM0P_GPIO_FSETE6_P64                            *((volatile unsigned int*)(0x42672310UL))
#define bM0P_GPIO_FSETE6_P65                            *((volatile unsigned int*)(0x42672314UL))
#define bM0P_GPIO_FSETE6_P66                            *((volatile unsigned int*)(0x42672318UL))
#define bM0P_GPIO_FSETE6_P67                            *((volatile unsigned int*)(0x4267231CUL))
#define bM0P_GPIO_FSETE7_P70                            *((volatile unsigned int*)(0x42672380UL))
#define bM0P_GPIO_FSETE7_P71                            *((volatile unsigned int*)(0x42672384UL))
#define bM0P_GPIO_FSETE7_P72                            *((volatile unsigned int*)(0x42672388UL))
#define bM0P_GPIO_FSETE7_P73                            *((volatile unsigned int*)(0x4267238CUL))
#define bM0P_GPIO_FSETE7_P74                            *((volatile unsigned int*)(0x42672390UL))
#define bM0P_GPIO_FSETE7_P75                            *((volatile unsigned int*)(0x42672394UL))
#define bM0P_GPIO_FSETE7_P76                            *((volatile unsigned int*)(0x42672398UL))
#define bM0P_HWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42220100UL))
#define bM0P_HWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42220104UL))
#define bM0P_HWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42220200UL))
#define bM0P_IRQC_IRQ_DSEL_AD0IS                        *((volatile unsigned int*)(0x42620014UL))
#define bM0P_IRQC_IRQ_DSEL_CT0IS                        *((volatile unsigned int*)(0x42620020UL))
#define bM0P_IRQC_IRQ_DSEL_CT2IS                        *((volatile unsigned int*)(0x42620024UL))
#define bM0P_IRQC_IRQ_DSEL_MSC4RXIS                     *((volatile unsigned int*)(0x42620050UL))
#define bM0P_IRQC_IRQ_DSEL_MSC4TXIS                     *((volatile unsigned int*)(0x42620054UL))
#define bM0P_IRQC_IRQ_DSEL_MSC5RXIS                     *((volatile unsigned int*)(0x42620058UL))
#define bM0P_IRQC_IRQ_DSEL_MSC5TXIS                     *((volatile unsigned int*)(0x4262005CUL))
#define bM0P_IRQC_IRQ_DSEL_MSC6RXIS                     *((volatile unsigned int*)(0x42620060UL))
#define bM0P_IRQC_IRQ_DSEL_MSC6TXIS                     *((volatile unsigned int*)(0x42620064UL))
#define bM0P_IRQC_IRQ_DSEL_E0IS                         *((volatile unsigned int*)(0x42620070UL))
#define bM0P_IRQC_IRQ_DSEL_E1IS                         *((volatile unsigned int*)(0x42620074UL))
#define bM0P_IRQC_IRQ_DSEL_E2IS                         *((volatile unsigned int*)(0x42620078UL))
#define bM0P_IRQC_IRQ_DSEL_E3IS                         *((volatile unsigned int*)(0x4262007CUL))
#define bM0P_IRQC_IRQ_ST02_NMI                          *((volatile unsigned int*)(0x42620200UL))
#define bM0P_IRQC_IRQ_ST02_HWWDT                        *((volatile unsigned int*)(0x42620204UL))
#define bM0P_IRQC_IRQ00PEND_AFDI                        *((volatile unsigned int*)(0x42620280UL))
#define bM0P_IRQC_IRQ01PEND_SWWDT                       *((volatile unsigned int*)(0x42620300UL))
#define bM0P_IRQC_IRQ02PEND_LVD                         *((volatile unsigned int*)(0x42620380UL))
#define bM0P_IRQC_IRQ03PEND_MEMIF                       *((volatile unsigned int*)(0x42620400UL))
#define bM0P_IRQC_IRQ03PEND_WOU10                       *((volatile unsigned int*)(0x42620404UL))
#define bM0P_IRQC_IRQ03PEND_WOU32                       *((volatile unsigned int*)(0x42620408UL))
#define bM0P_IRQC_IRQ03PEND_WOU54                       *((volatile unsigned int*)(0x4262040CUL))
#define bM0P_IRQC_IRQ04PEND_EXTI0                       *((volatile unsigned int*)(0x42620480UL))
#define bM0P_IRQC_IRQ04PEND_EXTI1                       *((volatile unsigned int*)(0x42620484UL))
#define bM0P_IRQC_IRQ04PEND_EXTI2                       *((volatile unsigned int*)(0x42620488UL))
#define bM0P_IRQC_IRQ04PEND_EXTI3                       *((volatile unsigned int*)(0x4262048CUL))
#define bM0P_IRQC_IRQ04PEND_EXTI4                       *((volatile unsigned int*)(0x42620490UL))
#define bM0P_IRQC_IRQ04PEND_EXTI5                       *((volatile unsigned int*)(0x42620494UL))
#define bM0P_IRQC_IRQ04PEND_EXTI6                       *((volatile unsigned int*)(0x42620498UL))
#define bM0P_IRQC_IRQ04PEND_EXTI7                       *((volatile unsigned int*)(0x4262049CUL))
#define bM0P_IRQC_IRQ05PEND_EXTI8                       *((volatile unsigned int*)(0x42620500UL))
#define bM0P_IRQC_IRQ05PEND_EXTI9                       *((volatile unsigned int*)(0x42620504UL))
#define bM0P_IRQC_IRQ05PEND_EXTI10                      *((volatile unsigned int*)(0x42620508UL))
#define bM0P_IRQC_IRQ05PEND_EXTI11                      *((volatile unsigned int*)(0x4262050CUL))
#define bM0P_IRQC_IRQ05PEND_EXTI12                      *((volatile unsigned int*)(0x42620510UL))
#define bM0P_IRQC_IRQ05PEND_EXTI13                      *((volatile unsigned int*)(0x42620514UL))
#define bM0P_IRQC_IRQ05PEND_EXTI14                      *((volatile unsigned int*)(0x42620518UL))
#define bM0P_IRQC_IRQ05PEND_EXTI15                      *((volatile unsigned int*)(0x4262051CUL))
#define bM0P_IRQC_IRQ06PEND_DT10                        *((volatile unsigned int*)(0x42620580UL))
#define bM0P_IRQC_IRQ06PEND_DT11                        *((volatile unsigned int*)(0x42620584UL))
#define bM0P_IRQC_IRQ15PEND_MSC4INT                     *((volatile unsigned int*)(0x42620A00UL))
#define bM0P_IRQC_IRQ16PEND_MSC4INT0                    *((volatile unsigned int*)(0x42620A80UL))
#define bM0P_IRQC_IRQ16PEND_MSC4INT1                    *((volatile unsigned int*)(0x42620A84UL))
#define bM0P_IRQC_IRQ17PEND_MSC5NT                      *((volatile unsigned int*)(0x42620B00UL))
#define bM0P_IRQC_IRQ18PEND_MSC5INT0                    *((volatile unsigned int*)(0x42620B80UL))
#define bM0P_IRQC_IRQ18PEND_MSC5INT1                    *((volatile unsigned int*)(0x42620B84UL))
#define bM0P_IRQC_IRQ19PEND_MSC6INT                     *((volatile unsigned int*)(0x42620C00UL))
