wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/hc32f_m14x.h
#define bM0P_TIMER4_OCER54_LMC1                         *((volatile unsigned int*)(0x42400464UL))
#define bM0P_TIMER4_OCER54_LMM0                         *((volatile unsigned int*)(0x42400468UL))
#define bM0P_TIMER4_OCER54_LMM1                         *((volatile unsigned int*)(0x4240046CUL))
#define bM0P_TIMER4_OCER54_MCEC0                        *((volatile unsigned int*)(0x42400470UL))
#define bM0P_TIMER4_OCER54_MCEC1                        *((volatile unsigned int*)(0x42400474UL))
#define bM0P_TIMER4_OCMR0_OCMR0                         *((volatile unsigned int*)(0x42400480UL))
#define bM0P_TIMER4_OCMR0_OCMR1                         *((volatile unsigned int*)(0x42400484UL))
#define bM0P_TIMER4_OCMR0_OCMR2                         *((volatile unsigned int*)(0x42400488UL))
#define bM0P_TIMER4_OCMR0_OCMR3                         *((volatile unsigned int*)(0x4240048CUL))
#define bM0P_TIMER4_OCMR0_OCMR4                         *((volatile unsigned int*)(0x42400490UL))
#define bM0P_TIMER4_OCMR0_OCMR5                         *((volatile unsigned int*)(0x42400494UL))
#define bM0P_TIMER4_OCMR0_OCMR6                         *((volatile unsigned int*)(0x42400498UL))
#define bM0P_TIMER4_OCMR0_OCMR7                         *((volatile unsigned int*)(0x4240049CUL))
#define bM0P_TIMER4_OCMR0_OCMR8                         *((volatile unsigned int*)(0x424004A0UL))
#define bM0P_TIMER4_OCMR0_OCMR9                         *((volatile unsigned int*)(0x424004A4UL))
#define bM0P_TIMER4_OCMR0_OCMR10                        *((volatile unsigned int*)(0x424004A8UL))
#define bM0P_TIMER4_OCMR0_OCMR11                        *((volatile unsigned int*)(0x424004ACUL))
#define bM0P_TIMER4_OCMR0_OCMR12                        *((volatile unsigned int*)(0x424004B0UL))
#define bM0P_TIMER4_OCMR0_OCMR13                        *((volatile unsigned int*)(0x424004B4UL))
#define bM0P_TIMER4_OCMR0_OCMR14                        *((volatile unsigned int*)(0x424004B8UL))
#define bM0P_TIMER4_OCMR0_OCMR15                        *((volatile unsigned int*)(0x424004BCUL))
#define bM0P_TIMER4_OCMR1_OCMR0                         *((volatile unsigned int*)(0x42400500UL))
#define bM0P_TIMER4_OCMR1_OCMR1                         *((volatile unsigned int*)(0x42400504UL))
#define bM0P_TIMER4_OCMR1_OCMR2                         *((volatile unsigned int*)(0x42400508UL))
#define bM0P_TIMER4_OCMR1_OCMR3                         *((volatile unsigned int*)(0x4240050CUL))
#define bM0P_TIMER4_OCMR1_OCMR4                         *((volatile unsigned int*)(0x42400510UL))
#define bM0P_TIMER4_OCMR1_OCMR5                         *((volatile unsigned int*)(0x42400514UL))
#define bM0P_TIMER4_OCMR1_OCMR6                         *((volatile unsigned int*)(0x42400518UL))
#define bM0P_TIMER4_OCMR1_OCMR7                         *((volatile unsigned int*)(0x4240051CUL))
#define bM0P_TIMER4_OCMR1_OCMR8                         *((volatile unsigned int*)(0x42400520UL))
#define bM0P_TIMER4_OCMR1_OCMR9                         *((volatile unsigned int*)(0x42400524UL))
#define bM0P_TIMER4_OCMR1_OCMR10                        *((volatile unsigned int*)(0x42400528UL))
#define bM0P_TIMER4_OCMR1_OCMR11                        *((volatile unsigned int*)(0x4240052CUL))
#define bM0P_TIMER4_OCMR1_OCMR12                        *((volatile unsigned int*)(0x42400530UL))
#define bM0P_TIMER4_OCMR1_OCMR13                        *((volatile unsigned int*)(0x42400534UL))
#define bM0P_TIMER4_OCMR1_OCMR14                        *((volatile unsigned int*)(0x42400538UL))
#define bM0P_TIMER4_OCMR1_OCMR15                        *((volatile unsigned int*)(0x4240053CUL))
#define bM0P_TIMER4_OCMR1_OCMR16                        *((volatile unsigned int*)(0x42400540UL))
#define bM0P_TIMER4_OCMR1_OCMR17                        *((volatile unsigned int*)(0x42400544UL))
#define bM0P_TIMER4_OCMR1_OCMR18                        *((volatile unsigned int*)(0x42400548UL))
#define bM0P_TIMER4_OCMR1_OCMR19                        *((volatile unsigned int*)(0x4240054CUL))
#define bM0P_TIMER4_OCMR1_OCMR20                        *((volatile unsigned int*)(0x42400550UL))
#define bM0P_TIMER4_OCMR1_OCMR21                        *((volatile unsigned int*)(0x42400554UL))
#define bM0P_TIMER4_OCMR1_OCMR22                        *((volatile unsigned int*)(0x42400558UL))
#define bM0P_TIMER4_OCMR1_OCMR23                        *((volatile unsigned int*)(0x4240055CUL))
#define bM0P_TIMER4_OCMR1_OCMR24                        *((volatile unsigned int*)(0x42400560UL))
#define bM0P_TIMER4_OCMR1_OCMR25                        *((volatile unsigned int*)(0x42400564UL))
#define bM0P_TIMER4_OCMR1_OCMR26                        *((volatile unsigned int*)(0x42400568UL))
#define bM0P_TIMER4_OCMR1_OCMR27                        *((volatile unsigned int*)(0x4240056CUL))
#define bM0P_TIMER4_OCMR1_OCMR28                        *((volatile unsigned int*)(0x42400570UL))
#define bM0P_TIMER4_OCMR1_OCMR29                        *((volatile unsigned int*)(0x42400574UL))
#define bM0P_TIMER4_OCMR1_OCMR30                        *((volatile unsigned int*)(0x42400578UL))
#define bM0P_TIMER4_OCMR1_OCMR31                        *((volatile unsigned int*)(0x4240057CUL))
#define bM0P_TIMER4_OCMR2_OCMR0                         *((volatile unsigned int*)(0x42400580UL))
#define bM0P_TIMER4_OCMR2_OCMR1                         *((volatile unsigned int*)(0x42400584UL))
#define bM0P_TIMER4_OCMR2_OCMR2                         *((volatile unsigned int*)(0x42400588UL))
#define bM0P_TIMER4_OCMR2_OCMR3                         *((volatile unsigned int*)(0x4240058CUL))
#define bM0P_TIMER4_OCMR2_OCMR4                         *((volatile unsigned int*)(0x42400590UL))
#define bM0P_TIMER4_OCMR2_OCMR5                         *((volatile unsigned int*)(0x42400594UL))
#define bM0P_TIMER4_OCMR2_OCMR6                         *((volatile unsigned int*)(0x42400598UL))
#define bM0P_TIMER4_OCMR2_OCMR7                         *((volatile unsigned int*)(0x4240059CUL))
#define bM0P_TIMER4_OCMR2_OCMR8                         *((volatile unsigned int*)(0x424005A0UL))
#define bM0P_TIMER4_OCMR2_OCMR9                         *((volatile unsigned int*)(0x424005A4UL))
#define bM0P_TIMER4_OCMR2_OCMR10                        *((volatile unsigned int*)(0x424005A8UL))
#define bM0P_TIMER4_OCMR2_OCMR11                        *((volatile unsigned int*)(0x424005ACUL))
#define bM0P_TIMER4_OCMR2_OCMR12                        *((volatile unsigned int*)(0x424005B0UL))
#define bM0P_TIMER4_OCMR2_OCMR13                        *((volatile unsigned int*)(0x424005B4UL))
#define bM0P_TIMER4_OCMR2_OCMR14                        *((volatile unsigned int*)(0x424005B8UL))
#define bM0P_TIMER4_OCMR2_OCMR15                        *((volatile unsigned int*)(0x424005BCUL))
#define bM0P_TIMER4_OCMR3_OCMR0                         *((volatile unsigned int*)(0x42400600UL))
#define bM0P_TIMER4_OCMR3_OCMR1                         *((volatile unsigned int*)(0x42400604UL))
#define bM0P_TIMER4_OCMR3_OCMR2                         *((volatile unsigned int*)(0x42400608UL))
#define bM0P_TIMER4_OCMR3_OCMR3                         *((volatile unsigned int*)(0x4240060CUL))
#define bM0P_TIMER4_OCMR3_OCMR4                         *((volatile unsigned int*)(0x42400610UL))
#define bM0P_TIMER4_OCMR3_OCMR5                         *((volatile unsigned int*)(0x42400614UL))
#define bM0P_TIMER4_OCMR3_OCMR6                         *((volatile unsigned int*)(0x42400618UL))
#define bM0P_TIMER4_OCMR3_OCMR7                         *((volatile unsigned int*)(0x4240061CUL))
#define bM0P_TIMER4_OCMR3_OCMR8                         *((volatile unsigned int*)(0x42400620UL))
#define bM0P_TIMER4_OCMR3_OCMR9                         *((volatile unsigned int*)(0x42400624UL))
#define bM0P_TIMER4_OCMR3_OCMR10                        *((volatile unsigned int*)(0x42400628UL))
#define bM0P_TIMER4_OCMR3_OCMR11                        *((volatile unsigned int*)(0x4240062CUL))
#define bM0P_TIMER4_OCMR3_OCMR12                        *((volatile unsigned int*)(0x42400630UL))
#define bM0P_TIMER4_OCMR3_OCMR13                        *((volatile unsigned int*)(0x42400634UL))
#define bM0P_TIMER4_OCMR3_OCMR14                        *((volatile unsigned int*)(0x42400638UL))
#define bM0P_TIMER4_OCMR3_OCMR15                        *((volatile unsigned int*)(0x4240063CUL))
#define bM0P_TIMER4_OCMR3_OCMR16                        *((volatile unsigned int*)(0x42400640UL))
#define bM0P_TIMER4_OCMR3_OCMR17                        *((volatile unsigned int*)(0x42400644UL))
#define bM0P_TIMER4_OCMR3_OCMR18                        *((volatile unsigned int*)(0x42400648UL))
#define bM0P_TIMER4_OCMR3_OCMR19                        *((volatile unsigned int*)(0x4240064CUL))
#define bM0P_TIMER4_OCMR3_OCMR20                        *((volatile unsigned int*)(0x42400650UL))
#define bM0P_TIMER4_OCMR3_OCMR21                        *((volatile unsigned int*)(0x42400654UL))
#define bM0P_TIMER4_OCMR3_OCMR22                        *((volatile unsigned int*)(0x42400658UL))
#define bM0P_TIMER4_OCMR3_OCMR23                        *((volatile unsigned int*)(0x4240065CUL))
#define bM0P_TIMER4_OCMR3_OCMR24                        *((volatile unsigned int*)(0x42400660UL))
#define bM0P_TIMER4_OCMR3_OCMR25                        *((volatile unsigned int*)(0x42400664UL))
#define bM0P_TIMER4_OCMR3_OCMR26                        *((volatile unsigned int*)(0x42400668UL))
#define bM0P_TIMER4_OCMR3_OCMR27                        *((volatile unsigned int*)(0x4240066CUL))
#define bM0P_TIMER4_OCMR3_OCMR28                        *((volatile unsigned int*)(0x42400670UL))
#define bM0P_TIMER4_OCMR3_OCMR29                        *((volatile unsigned int*)(0x42400674UL))
#define bM0P_TIMER4_OCMR3_OCMR30                        *((volatile unsigned int*)(0x42400678UL))
#define bM0P_TIMER4_OCMR3_OCMR31                        *((volatile unsigned int*)(0x4240067CUL))
#define bM0P_TIMER4_OCMR4_OCMR0                         *((volatile unsigned int*)(0x42400680UL))
#define bM0P_TIMER4_OCMR4_OCMR1                         *((volatile unsigned int*)(0x42400684UL))
#define bM0P_TIMER4_OCMR4_OCMR2                         *((volatile unsigned int*)(0x42400688UL))
#define bM0P_TIMER4_OCMR4_OCMR3                         *((volatile unsigned int*)(0x4240068CUL))
#define bM0P_TIMER4_OCMR4_OCMR4                         *((volatile unsigned int*)(0x42400690UL))
#define bM0P_TIMER4_OCMR4_OCMR5                         *((volatile unsigned int*)(0x42400694UL))
#define bM0P_TIMER4_OCMR4_OCMR6                         *((volatile unsigned int*)(0x42400698UL))
#define bM0P_TIMER4_OCMR4_OCMR7                         *((volatile unsigned int*)(0x4240069CUL))
#define bM0P_TIMER4_OCMR4_OCMR8                         *((volatile unsigned int*)(0x424006A0UL))
#define bM0P_TIMER4_OCMR4_OCMR9                         *((volatile unsigned int*)(0x424006A4UL))
#define bM0P_TIMER4_OCMR4_OCMR10                        *((volatile unsigned int*)(0x424006A8UL))
#define bM0P_TIMER4_OCMR4_OCMR11                        *((volatile unsigned int*)(0x424006ACUL))
#define bM0P_TIMER4_OCMR4_OCMR12                        *((volatile unsigned int*)(0x424006B0UL))
#define bM0P_TIMER4_OCMR4_OCMR13                        *((volatile unsigned int*)(0x424006B4UL))
#define bM0P_TIMER4_OCMR4_OCMR14                        *((volatile unsigned int*)(0x424006B8UL))
#define bM0P_TIMER4_OCMR4_OCMR15                        *((volatile unsigned int*)(0x424006BCUL))
#define bM0P_TIMER4_OCMR5_OCMR0                         *((volatile unsigned int*)(0x42400700UL))
#define bM0P_TIMER4_OCMR5_OCMR1                         *((volatile unsigned int*)(0x42400704UL))
#define bM0P_TIMER4_OCMR5_OCMR2                         *((volatile unsigned int*)(0x42400708UL))
#define bM0P_TIMER4_OCMR5_OCMR3                         *((volatile unsigned int*)(0x4240070CUL))
#define bM0P_TIMER4_OCMR5_OCMR4                         *((volatile unsigned int*)(0x42400710UL))
#define bM0P_TIMER4_OCMR5_OCMR5                         *((volatile unsigned int*)(0x42400714UL))
#define bM0P_TIMER4_OCMR5_OCMR6                         *((volatile unsigned int*)(0x42400718UL))
#define bM0P_TIMER4_OCMR5_OCMR7                         *((volatile unsigned int*)(0x4240071CUL))
#define bM0P_TIMER4_OCMR5_OCMR8                         *((volatile unsigned int*)(0x42400720UL))
#define bM0P_TIMER4_OCMR5_OCMR9                         *((volatile unsigned int*)(0x42400724UL))
#define bM0P_TIMER4_OCMR5_OCMR10                        *((volatile unsigned int*)(0x42400728UL))
#define bM0P_TIMER4_OCMR5_OCMR11                        *((volatile unsigned int*)(0x4240072CUL))
#define bM0P_TIMER4_OCMR5_OCMR12                        *((volatile unsigned int*)(0x42400730UL))
#define bM0P_TIMER4_OCMR5_OCMR13                        *((volatile unsigned int*)(0x42400734UL))
#define bM0P_TIMER4_OCMR5_OCMR14                        *((volatile unsigned int*)(0x42400738UL))
#define bM0P_TIMER4_OCMR5_OCMR15                        *((volatile unsigned int*)(0x4240073CUL))
#define bM0P_TIMER4_OCMR5_OCMR16                        *((volatile unsigned int*)(0x42400740UL))
#define bM0P_TIMER4_OCMR5_OCMR17                        *((volatile unsigned int*)(0x42400744UL))
#define bM0P_TIMER4_OCMR5_OCMR18                        *((volatile unsigned int*)(0x42400748UL))
#define bM0P_TIMER4_OCMR5_OCMR19                        *((volatile unsigned int*)(0x4240074CUL))
#define bM0P_TIMER4_OCMR5_OCMR20                        *((volatile unsigned int*)(0x42400750UL))
#define bM0P_TIMER4_OCMR5_OCMR21                        *((volatile unsigned int*)(0x42400754UL))
#define bM0P_TIMER4_OCMR5_OCMR22                        *((volatile unsigned int*)(0x42400758UL))
#define bM0P_TIMER4_OCMR5_OCMR23                        *((volatile unsigned int*)(0x4240075CUL))
#define bM0P_TIMER4_OCMR5_OCMR24                        *((volatile unsigned int*)(0x42400760UL))
#define bM0P_TIMER4_OCMR5_OCMR25                        *((volatile unsigned int*)(0x42400764UL))
#define bM0P_TIMER4_OCMR5_OCMR26                        *((volatile unsigned int*)(0x42400768UL))
#define bM0P_TIMER4_OCMR5_OCMR27                        *((volatile unsigned int*)(0x4240076CUL))
#define bM0P_TIMER4_OCMR5_OCMR28                        *((volatile unsigned int*)(0x42400770UL))
#define bM0P_TIMER4_OCMR5_OCMR29                        *((volatile unsigned int*)(0x42400774UL))
#define bM0P_TIMER4_OCMR5_OCMR30                        *((volatile unsigned int*)(0x42400778UL))
#define bM0P_TIMER4_OCMR5_OCMR31                        *((volatile unsigned int*)(0x4240077CUL))
#define bM0P_TIMER4_CCSR_DCLK0                          *((volatile unsigned int*)(0x42400900UL))
#define bM0P_TIMER4_CCSR_DCLK1                          *((volatile unsigned int*)(0x42400904UL))
#define bM0P_TIMER4_CCSR_DCLK2                          *((volatile unsigned int*)(0x42400908UL))
#define bM0P_TIMER4_CCSR_DCLK3                          *((volatile unsigned int*)(0x4240090CUL))
#define bM0P_TIMER4_CCSR_CLEAR                          *((volatile unsigned int*)(0x42400910UL))
#define bM0P_TIMER4_CCSR_CNTMD                          *((volatile unsigned int*)(0x42400914UL))
#define bM0P_TIMER4_CCSR_STOP                           *((volatile unsigned int*)(0x42400918UL))
#define bM0P_TIMER4_CCSR_BUFEN                          *((volatile unsigned int*)(0x4240091CUL))
#define bM0P_TIMER4_CCSR_ICLEN                          *((volatile unsigned int*)(0x42400920UL))
#define bM0P_TIMER4_CCSR_ICLR                           *((volatile unsigned int*)(0x42400924UL))
#define bM0P_TIMER4_CCSR_IRQZEN                         *((volatile unsigned int*)(0x42400934UL))
#define bM0P_TIMER4_CCSR_IRQZF                          *((volatile unsigned int*)(0x42400938UL))
#define bM0P_TIMER4_CCSR_ECKEN                          *((volatile unsigned int*)(0x4240093CUL))
#define bM0P_TIMER4_CIMR_ZIM0                           *((volatile unsigned int*)(0x42400940UL))
#define bM0P_TIMER4_CIMR_ZIM1                           *((volatile unsigned int*)(0x42400944UL))
#define bM0P_TIMER4_CIMR_ZIM2                           *((volatile unsigned int*)(0x42400948UL))
#define bM0P_TIMER4_CIMR_ZIM3                           *((volatile unsigned int*)(0x4240094CUL))
#define bM0P_TIMER4_CIMR_PIM0                           *((volatile unsigned int*)(0x42400950UL))
#define bM0P_TIMER4_CIMR_PIM1                           *((volatile unsigned int*)(0x42400954UL))
#define bM0P_TIMER4_CIMR_PIM2                           *((volatile unsigned int*)(0x42400958UL))
#define bM0P_TIMER4_CIMR_PIM3                           *((volatile unsigned int*)(0x4240095CUL))
#define bM0P_TIMER4_CIMR_ZIC0                           *((volatile unsigned int*)(0x42400960UL))
#define bM0P_TIMER4_CIMR_ZIC1                           *((volatile unsigned int*)(0x42400964UL))
#define bM0P_TIMER4_CIMR_ZIC2                           *((volatile unsigned int*)(0x42400968UL))
#define bM0P_TIMER4_CIMR_ZIC3                           *((volatile unsigned int*)(0x4240096CUL))
#define bM0P_TIMER4_CIMR_PIC0                           *((volatile unsigned int*)(0x42400970UL))
#define bM0P_TIMER4_CIMR_PIC1                           *((volatile unsigned int*)(0x42400974UL))
#define bM0P_TIMER4_CIMR_PIC2                           *((volatile unsigned int*)(0x42400978UL))
#define bM0P_TIMER4_CIMR_PIC3                           *((volatile unsigned int*)(0x4240097CUL))
#define bM0P_TIMER4_POCR10_DIVCK0                       *((volatile unsigned int*)(0x42401300UL))
#define bM0P_TIMER4_POCR10_DIVCK1                       *((volatile unsigned int*)(0x42401304UL))
#define bM0P_TIMER4_POCR10_DIVCK2                       *((volatile unsigned int*)(0x42401308UL))
#define bM0P_TIMER4_POCR10_WMD0                         *((volatile unsigned int*)(0x42401310UL))
#define bM0P_TIMER4_POCR10_WMD1                         *((volatile unsigned int*)(0x42401314UL))
#define bM0P_TIMER4_POCR10_LVLS0                        *((volatile unsigned int*)(0x42401318UL))
#define bM0P_TIMER4_POCR10_LVLS1                        *((volatile unsigned int*)(0x4240131CUL))
#define bM0P_TIMER4_POCR32_DIVCK0                       *((volatile unsigned int*)(0x42401380UL))
#define bM0P_TIMER4_POCR32_DIVCK1                       *((volatile unsigned int*)(0x42401384UL))
#define bM0P_TIMER4_POCR32_DIVCK2                       *((volatile unsigned int*)(0x42401388UL))
#define bM0P_TIMER4_POCR32_WMD0                         *((volatile unsigned int*)(0x42401390UL))
#define bM0P_TIMER4_POCR32_WMD1                         *((volatile unsigned int*)(0x42401394UL))
#define bM0P_TIMER4_POCR32_LVLS0                        *((volatile unsigned int*)(0x42401398UL))
#define bM0P_TIMER4_POCR32_LVLS1                        *((volatile unsigned int*)(0x4240139CUL))
#define bM0P_TIMER4_POCR54_DIVCK0                       *((volatile unsigned int*)(0x42401400UL))
#define bM0P_TIMER4_POCR54_DIVCK1                       *((volatile unsigned int*)(0x42401404UL))
#define bM0P_TIMER4_POCR54_DIVCK2                       *((volatile unsigned int*)(0x42401408UL))
#define bM0P_TIMER4_POCR54_WMD0                         *((volatile unsigned int*)(0x42401410UL))
#define bM0P_TIMER4_POCR54_WMD1                         *((volatile unsigned int*)(0x42401414UL))
#define bM0P_TIMER4_POCR54_LVLS0                        *((volatile unsigned int*)(0x42401418UL))
#define bM0P_TIMER4_POCR54_LVLS1                        *((volatile unsigned int*)(0x4240141CUL))
#define bM0P_TIMER4_RCSR_RTID10                         *((volatile unsigned int*)(0x42401480UL))
#define bM0P_TIMER4_RCSR_RTID32                         *((volatile unsigned int*)(0x42401484UL))
#define bM0P_TIMER4_RCSR_RTID54                         *((volatile unsigned int*)(0x42401488UL))
#define bM0P_TIMER4_RCSR_RTIF10                         *((volatile unsigned int*)(0x42401490UL))
#define bM0P_TIMER4_RCSR_RTIC10                         *((volatile unsigned int*)(0x42401494UL))
#define bM0P_TIMER4_RCSR_RTE10                          *((volatile unsigned int*)(0x42401498UL))
#define bM0P_TIMER4_RCSR_RTS10                          *((volatile unsigned int*)(0x4240149CUL))
#define bM0P_TIMER4_RCSR_RTIF32                         *((volatile unsigned int*)(0x424014A0UL))
#define bM0P_TIMER4_RCSR_RTIC32                         *((volatile unsigned int*)(0x424014A4UL))
#define bM0P_TIMER4_RCSR_RTE32                          *((volatile unsigned int*)(0x424014A8UL))
#define bM0P_TIMER4_RCSR_RTS32                          *((volatile unsigned int*)(0x424014ACUL))
#define bM0P_TIMER4_RCSR_RTIF54                         *((volatile unsigned int*)(0x424014B0UL))
#define bM0P_TIMER4_RCSR_RTIC54                         *((volatile unsigned int*)(0x424014B4UL))
#define bM0P_TIMER4_RCSR_RTE54                          *((volatile unsigned int*)(0x424014B8UL))
#define bM0P_TIMER4_RCSR_RTS54                          *((volatile unsigned int*)(0x424014BCUL))
#define bM0P_TIMER4_ATCR0_BUFEN0                        *((volatile unsigned int*)(0x42401900UL))
#define bM0P_TIMER4_ATCR0_BUFEN1                        *((volatile unsigned int*)(0x42401904UL))
#define bM0P_TIMER4_ATCR0_ADTRGS0                       *((volatile unsigned int*)(0x42401908UL))
#define bM0P_TIMER4_ATCR0_ADTRGS1                       *((volatile unsigned int*)(0x4240190CUL))
#define bM0P_TIMER4_ATCR0_ADTRGS2                       *((volatile unsigned int*)(0x42401910UL))
#define bM0P_TIMER4_ATCR0_LMC                           *((volatile unsigned int*)(0x42401914UL))
#define bM0P_TIMER4_ATER0_TRGMD                         *((volatile unsigned int*)(0x42401920UL))
#define bM0P_TIMER4_ATER0_OCS                           *((volatile unsigned int*)(0x42401924UL))
#define bM0P_TIMER4_ATER0_DEN                           *((volatile unsigned int*)(0x42401930UL))
#define bM0P_TIMER4_ATER0_PEN                           *((volatile unsigned int*)(0x42401934UL))
#define bM0P_TIMER4_ATER0_UEN                           *((volatile unsigned int*)(0x42401938UL))
#define bM0P_TIMER4_ATER0_ZEN                           *((volatile unsigned int*)(0x4240193CUL))
#define bM0P_TIMER4_ATMR0_AMC0                          *((volatile unsigned int*)(0x42401940UL))
#define bM0P_TIMER4_ATMR0_AMC1                          *((volatile unsigned int*)(0x42401944UL))
#define bM0P_TIMER4_ATMR0_AMC2                          *((volatile unsigned int*)(0x42401948UL))
#define bM0P_TIMER4_ATMR0_AMC3                          *((volatile unsigned int*)(0x4240194CUL))
#define bM0P_TIMER4_ATMR0_MZCE                          *((volatile unsigned int*)(0x42401958UL))
#define bM0P_TIMER4_ATMR0_MPCE                          *((volatile unsigned int*)(0x4240195CUL))
#define bM0P_TIMER4_ATCR1_BUFEN0                        *((volatile unsigned int*)(0x42401980UL))
#define bM0P_TIMER4_ATCR1_BUFEN1                        *((volatile unsigned int*)(0x42401984UL))
#define bM0P_TIMER4_ATCR1_ADTRGS0                       *((volatile unsigned int*)(0x42401988UL))
#define bM0P_TIMER4_ATCR1_ADTRGS1                       *((volatile unsigned int*)(0x4240198CUL))
#define bM0P_TIMER4_ATCR1_ADTRGS2                       *((volatile unsigned int*)(0x42401990UL))
#define bM0P_TIMER4_ATCR1_LMC                           *((volatile unsigned int*)(0x42401994UL))
#define bM0P_TIMER4_ATER1_TRGMD                         *((volatile unsigned int*)(0x424019A0UL))
#define bM0P_TIMER4_ATER1_OCS                           *((volatile unsigned int*)(0x424019A4UL))
#define bM0P_TIMER4_ATER1_DEN                           *((volatile unsigned int*)(0x424019B0UL))
#define bM0P_TIMER4_ATER1_PEN                           *((volatile unsigned int*)(0x424019B4UL))
#define bM0P_TIMER4_ATER1_UEN                           *((volatile unsigned int*)(0x424019B8UL))
#define bM0P_TIMER4_ATER1_ZEN                           *((volatile unsigned int*)(0x424019BCUL))
