wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/hc32f_m14x.h
#define bM0P_TIMER4_ATMR1_AMC0                          *((volatile unsigned int*)(0x424019C0UL))
#define bM0P_TIMER4_ATMR1_AMC1                          *((volatile unsigned int*)(0x424019C4UL))
#define bM0P_TIMER4_ATMR1_AMC2                          *((volatile unsigned int*)(0x424019C8UL))
#define bM0P_TIMER4_ATMR1_AMC3                          *((volatile unsigned int*)(0x424019CCUL))
#define bM0P_TIMER4_ATMR1_MZCE                          *((volatile unsigned int*)(0x424019D8UL))
#define bM0P_TIMER4_ATMR1_MPCE                          *((volatile unsigned int*)(0x424019DCUL))
#define bM0P_TIMER4_ATCR2_BUFEN0                        *((volatile unsigned int*)(0x42401A00UL))
#define bM0P_TIMER4_ATCR2_BUFEN1                        *((volatile unsigned int*)(0x42401A04UL))
#define bM0P_TIMER4_ATCR2_ADTRGS0                       *((volatile unsigned int*)(0x42401A08UL))
#define bM0P_TIMER4_ATCR2_ADTRGS1                       *((volatile unsigned int*)(0x42401A0CUL))
#define bM0P_TIMER4_ATCR2_ADTRGS2                       *((volatile unsigned int*)(0x42401A10UL))
#define bM0P_TIMER4_ATCR2_LMC                           *((volatile unsigned int*)(0x42401A14UL))
#define bM0P_TIMER4_ATER2_TRGMD                         *((volatile unsigned int*)(0x42401A20UL))
#define bM0P_TIMER4_ATER2_OCS                           *((volatile unsigned int*)(0x42401A24UL))
#define bM0P_TIMER4_ATER2_DEN                           *((volatile unsigned int*)(0x42401A30UL))
#define bM0P_TIMER4_ATER2_PEN                           *((volatile unsigned int*)(0x42401A34UL))
#define bM0P_TIMER4_ATER2_UEN                           *((volatile unsigned int*)(0x42401A38UL))
#define bM0P_TIMER4_ATER2_ZEN                           *((volatile unsigned int*)(0x42401A3CUL))
#define bM0P_TIMER4_ATMR2_AMC0                          *((volatile unsigned int*)(0x42401A40UL))
#define bM0P_TIMER4_ATMR2_AMC1                          *((volatile unsigned int*)(0x42401A44UL))
#define bM0P_TIMER4_ATMR2_AMC2                          *((volatile unsigned int*)(0x42401A48UL))
#define bM0P_TIMER4_ATMR2_AMC3                          *((volatile unsigned int*)(0x42401A4CUL))
#define bM0P_TIMER4_ATMR2_MZCE                          *((volatile unsigned int*)(0x42401A58UL))
#define bM0P_TIMER4_ATMR2_MPCE                          *((volatile unsigned int*)(0x42401A5CUL))
#define bM0P_TIMER4_ATCR3_BUFEN0                        *((volatile unsigned int*)(0x42401A80UL))
#define bM0P_TIMER4_ATCR3_BUFEN1                        *((volatile unsigned int*)(0x42401A84UL))
#define bM0P_TIMER4_ATCR3_ADTRGS0                       *((volatile unsigned int*)(0x42401A88UL))
#define bM0P_TIMER4_ATCR3_ADTRGS1                       *((volatile unsigned int*)(0x42401A8CUL))
#define bM0P_TIMER4_ATCR3_ADTRGS2                       *((volatile unsigned int*)(0x42401A90UL))
#define bM0P_TIMER4_ATCR3_LMC                           *((volatile unsigned int*)(0x42401A94UL))
#define bM0P_TIMER4_ATER3_TRGMD                         *((volatile unsigned int*)(0x42401AA0UL))
#define bM0P_TIMER4_ATER3_OCS                           *((volatile unsigned int*)(0x42401AA4UL))
#define bM0P_TIMER4_ATER3_DEN                           *((volatile unsigned int*)(0x42401AB0UL))
#define bM0P_TIMER4_ATER3_PEN                           *((volatile unsigned int*)(0x42401AB4UL))
#define bM0P_TIMER4_ATER3_UEN                           *((volatile unsigned int*)(0x42401AB8UL))
#define bM0P_TIMER4_ATER3_ZEN                           *((volatile unsigned int*)(0x42401ABCUL))
#define bM0P_TIMER4_ATMR3_AMC0                          *((volatile unsigned int*)(0x42401AC0UL))
#define bM0P_TIMER4_ATMR3_AMC1                          *((volatile unsigned int*)(0x42401AC4UL))
#define bM0P_TIMER4_ATMR3_AMC2                          *((volatile unsigned int*)(0x42401AC8UL))
#define bM0P_TIMER4_ATMR3_AMC3                          *((volatile unsigned int*)(0x42401ACCUL))
#define bM0P_TIMER4_ATMR3_MZCE                          *((volatile unsigned int*)(0x42401AD8UL))
#define bM0P_TIMER4_ATMR3_MPCE                          *((volatile unsigned int*)(0x42401ADCUL))
#define bM0P_TIMER4_ATCR4_BUFEN0                        *((volatile unsigned int*)(0x42401B00UL))
#define bM0P_TIMER4_ATCR4_BUFEN1                        *((volatile unsigned int*)(0x42401B04UL))
#define bM0P_TIMER4_ATCR4_ADTRGS0                       *((volatile unsigned int*)(0x42401B08UL))
#define bM0P_TIMER4_ATCR4_ADTRGS1                       *((volatile unsigned int*)(0x42401B0CUL))
#define bM0P_TIMER4_ATCR4_ADTRGS2                       *((volatile unsigned int*)(0x42401B10UL))
#define bM0P_TIMER4_ATCR4_LMC                           *((volatile unsigned int*)(0x42401B14UL))
#define bM0P_TIMER4_ATER4_TRGMD                         *((volatile unsigned int*)(0x42401B20UL))
#define bM0P_TIMER4_ATER4_OCS                           *((volatile unsigned int*)(0x42401B24UL))
#define bM0P_TIMER4_ATER4_DEN                           *((volatile unsigned int*)(0x42401B30UL))
#define bM0P_TIMER4_ATER4_PEN                           *((volatile unsigned int*)(0x42401B34UL))
#define bM0P_TIMER4_ATER4_UEN                           *((volatile unsigned int*)(0x42401B38UL))
#define bM0P_TIMER4_ATER4_ZEN                           *((volatile unsigned int*)(0x42401B3CUL))
#define bM0P_TIMER4_ATMR4_AMC0                          *((volatile unsigned int*)(0x42401B40UL))
#define bM0P_TIMER4_ATMR4_AMC1                          *((volatile unsigned int*)(0x42401B44UL))
#define bM0P_TIMER4_ATMR4_AMC2                          *((volatile unsigned int*)(0x42401B48UL))
#define bM0P_TIMER4_ATMR4_AMC3                          *((volatile unsigned int*)(0x42401B4CUL))
#define bM0P_TIMER4_ATMR4_MZCE                          *((volatile unsigned int*)(0x42401B58UL))
#define bM0P_TIMER4_ATMR4_MPCE                          *((volatile unsigned int*)(0x42401B5CUL))
#define bM0P_TIMER4_ATCR5_BUFEN0                        *((volatile unsigned int*)(0x42401B80UL))
#define bM0P_TIMER4_ATCR5_BUFEN1                        *((volatile unsigned int*)(0x42401B84UL))
#define bM0P_TIMER4_ATCR5_ADTRGS0                       *((volatile unsigned int*)(0x42401B88UL))
#define bM0P_TIMER4_ATCR5_ADTRGS1                       *((volatile unsigned int*)(0x42401B8CUL))
#define bM0P_TIMER4_ATCR5_ADTRGS2                       *((volatile unsigned int*)(0x42401B90UL))
#define bM0P_TIMER4_ATCR5_LMC                           *((volatile unsigned int*)(0x42401B94UL))
#define bM0P_TIMER4_ATER5_TRGMD                         *((volatile unsigned int*)(0x42401BA0UL))
#define bM0P_TIMER4_ATER5_OCS                           *((volatile unsigned int*)(0x42401BA4UL))
#define bM0P_TIMER4_ATER5_DEN                           *((volatile unsigned int*)(0x42401BB0UL))
#define bM0P_TIMER4_ATER5_PEN                           *((volatile unsigned int*)(0x42401BB4UL))
#define bM0P_TIMER4_ATER5_UEN                           *((volatile unsigned int*)(0x42401BB8UL))
#define bM0P_TIMER4_ATER5_ZEN                           *((volatile unsigned int*)(0x42401BBCUL))
#define bM0P_TIMER4_ATMR5_AMC0                          *((volatile unsigned int*)(0x42401BC0UL))
#define bM0P_TIMER4_ATMR5_AMC1                          *((volatile unsigned int*)(0x42401BC4UL))
#define bM0P_TIMER4_ATMR5_AMC2                          *((volatile unsigned int*)(0x42401BC8UL))
#define bM0P_TIMER4_ATMR5_AMC3                          *((volatile unsigned int*)(0x42401BCCUL))
#define bM0P_TIMER4_ATMR5_MZCE                          *((volatile unsigned int*)(0x42401BD8UL))
#define bM0P_TIMER4_ATMR5_MPCE                          *((volatile unsigned int*)(0x42401BDCUL))
#define bM0P_TIMER4_ESCR_DPE                            *((volatile unsigned int*)(0x42401E00UL))
#define bM0P_TIMER4_ESCR_NCS0                           *((volatile unsigned int*)(0x42401E04UL))
#define bM0P_TIMER4_ESCR_NCS1                           *((volatile unsigned int*)(0x42401E08UL))
#define bM0P_TIMER4_ESCR_NCS2                           *((volatile unsigned int*)(0x42401E0CUL))
#define bM0P_TIMER4_ESCR_SDI                            *((volatile unsigned int*)(0x42401E10UL))
#define bM0P_TIMER4_ESCR_APE                            *((volatile unsigned int*)(0x42401E14UL))
#define bM0P_TIMER4_ESCR_HOLD                           *((volatile unsigned int*)(0x42401E1CUL))
#define bM0P_TIMER4_ESCR_DID                            *((volatile unsigned int*)(0x42401E20UL))
#define bM0P_TIMER4_ESCR_AID                            *((volatile unsigned int*)(0x42401E24UL))
#define bM0P_TIMER4_ESCR_DIF                            *((volatile unsigned int*)(0x42401E30UL))
#define bM0P_TIMER4_ESCR_DIFC                           *((volatile unsigned int*)(0x42401E34UL))
#define bM0P_TIMER4_ESCR_AIF                            *((volatile unsigned int*)(0x42401E38UL))
#define bM0P_TIMER4_ESCR_AIFC                           *((volatile unsigned int*)(0x42401E3CUL))
#define bM0P_UID_UIDR0_UID0                             *((volatile unsigned int*)(0x42004000UL))
#define bM0P_UID_UIDR0_UID1                             *((volatile unsigned int*)(0x42004004UL))
#define bM0P_UID_UIDR0_UID2                             *((volatile unsigned int*)(0x42004008UL))
#define bM0P_UID_UIDR0_UID3                             *((volatile unsigned int*)(0x4200400CUL))
#define bM0P_UID_UIDR0_UID4                             *((volatile unsigned int*)(0x42004010UL))
#define bM0P_UID_UIDR0_UID5                             *((volatile unsigned int*)(0x42004014UL))
#define bM0P_UID_UIDR0_UID6                             *((volatile unsigned int*)(0x42004018UL))
#define bM0P_UID_UIDR0_UID7                             *((volatile unsigned int*)(0x4200401CUL))
#define bM0P_UID_UIDR0_UID8                             *((volatile unsigned int*)(0x42004020UL))
#define bM0P_UID_UIDR0_UID9                             *((volatile unsigned int*)(0x42004024UL))
#define bM0P_UID_UIDR0_UID10                            *((volatile unsigned int*)(0x42004028UL))
#define bM0P_UID_UIDR0_UID11                            *((volatile unsigned int*)(0x4200402CUL))
#define bM0P_UID_UIDR0_UID12                            *((volatile unsigned int*)(0x42004030UL))
#define bM0P_UID_UIDR0_UID13                            *((volatile unsigned int*)(0x42004034UL))
#define bM0P_UID_UIDR0_UID14                            *((volatile unsigned int*)(0x42004038UL))
#define bM0P_UID_UIDR0_UID15                            *((volatile unsigned int*)(0x4200403CUL))
#define bM0P_UID_UIDR0_UID16                            *((volatile unsigned int*)(0x42004040UL))
#define bM0P_UID_UIDR0_UID17                            *((volatile unsigned int*)(0x42004044UL))
#define bM0P_UID_UIDR0_UID18                            *((volatile unsigned int*)(0x42004048UL))
#define bM0P_UID_UIDR0_UID19                            *((volatile unsigned int*)(0x4200404CUL))
#define bM0P_UID_UIDR0_UID20                            *((volatile unsigned int*)(0x42004050UL))
#define bM0P_UID_UIDR0_UID21                            *((volatile unsigned int*)(0x42004054UL))
#define bM0P_UID_UIDR0_UID22                            *((volatile unsigned int*)(0x42004058UL))
#define bM0P_UID_UIDR0_UID23                            *((volatile unsigned int*)(0x4200405CUL))
#define bM0P_UID_UIDR0_UID24                            *((volatile unsigned int*)(0x42004060UL))
#define bM0P_UID_UIDR0_UID25                            *((volatile unsigned int*)(0x42004064UL))
#define bM0P_UID_UIDR0_UID26                            *((volatile unsigned int*)(0x42004068UL))
#define bM0P_UID_UIDR0_UID27                            *((volatile unsigned int*)(0x4200406CUL))
#define bM0P_UID_UIDR0_UID28                            *((volatile unsigned int*)(0x42004070UL))
#define bM0P_UID_UIDR0_UID29                            *((volatile unsigned int*)(0x42004074UL))
#define bM0P_UID_UIDR0_UID30                            *((volatile unsigned int*)(0x42004078UL))
#define bM0P_UID_UIDR0_UID31                            *((volatile unsigned int*)(0x4200407CUL))
#define bM0P_UID_UIDR1_UID0                             *((volatile unsigned int*)(0x42004080UL))
#define bM0P_UID_UIDR1_UID1                             *((volatile unsigned int*)(0x42004084UL))
#define bM0P_UID_UIDR1_UID2                             *((volatile unsigned int*)(0x42004088UL))
#define bM0P_UID_UIDR1_UID3                             *((volatile unsigned int*)(0x4200408CUL))
#define bM0P_UID_UIDR1_UID4                             *((volatile unsigned int*)(0x42004090UL))
#define bM0P_UID_UIDR1_UID5                             *((volatile unsigned int*)(0x42004094UL))
#define bM0P_UID_UIDR1_UID6                             *((volatile unsigned int*)(0x42004098UL))
#define bM0P_UID_UIDR1_UID7                             *((volatile unsigned int*)(0x4200409CUL))
#define bM0P_UID_UIDR1_UID8                             *((volatile unsigned int*)(0x420040A0UL))
#define bM0P_UID_UIDR1_UID9                             *((volatile unsigned int*)(0x420040A4UL))
#define bM0P_UID_UIDR1_UID10                            *((volatile unsigned int*)(0x420040A8UL))
#define bM0P_UID_UIDR1_UID11                            *((volatile unsigned int*)(0x420040ACUL))
#define bM0P_UID_UIDR1_UID12                            *((volatile unsigned int*)(0x420040B0UL))
#define bM0P_UID_UIDR1_UID13                            *((volatile unsigned int*)(0x420040B4UL))
#define bM0P_UID_UIDR1_UID14                            *((volatile unsigned int*)(0x420040B8UL))
#define bM0P_UID_UIDR1_UID15                            *((volatile unsigned int*)(0x420040BCUL))
#define bM0P_UID_UIDR1_UID16                            *((volatile unsigned int*)(0x420040C0UL))
#define bM0P_UID_UIDR1_UID17                            *((volatile unsigned int*)(0x420040C4UL))
#define bM0P_UID_UIDR1_UID18                            *((volatile unsigned int*)(0x420040C8UL))
#define bM0P_UID_UIDR1_UID19                            *((volatile unsigned int*)(0x420040CCUL))
#define bM0P_UID_UIDR1_UID20                            *((volatile unsigned int*)(0x420040D0UL))
#define bM0P_UID_UIDR1_UID21                            *((volatile unsigned int*)(0x420040D4UL))
#define bM0P_UID_UIDR1_UID22                            *((volatile unsigned int*)(0x420040D8UL))
#define bM0P_UID_UIDR1_UID23                            *((volatile unsigned int*)(0x420040DCUL))
#define bM0P_UID_UIDR1_UID24                            *((volatile unsigned int*)(0x420040E0UL))
#define bM0P_UID_UIDR1_UID25                            *((volatile unsigned int*)(0x420040E4UL))
#define bM0P_UID_UIDR1_UID26                            *((volatile unsigned int*)(0x420040E8UL))
#define bM0P_UID_UIDR1_UID27                            *((volatile unsigned int*)(0x420040ECUL))
#define bM0P_UID_UIDR1_UID28                            *((volatile unsigned int*)(0x420040F0UL))
#define bM0P_UID_UIDR1_UID29                            *((volatile unsigned int*)(0x420040F4UL))
#define bM0P_UID_UIDR1_UID30                            *((volatile unsigned int*)(0x420040F8UL))
#define bM0P_UID_UIDR1_UID31                            *((volatile unsigned int*)(0x420040FCUL))
#define bM0P_UID_UIDR2_UID0                             *((volatile unsigned int*)(0x42004100UL))
#define bM0P_UID_UIDR2_UID1                             *((volatile unsigned int*)(0x42004104UL))
#define bM0P_UID_UIDR2_UID2                             *((volatile unsigned int*)(0x42004108UL))
#define bM0P_UID_UIDR2_UID3                             *((volatile unsigned int*)(0x4200410CUL))
#define bM0P_UID_UIDR2_UID4                             *((volatile unsigned int*)(0x42004110UL))
#define bM0P_UID_UIDR2_UID5                             *((volatile unsigned int*)(0x42004114UL))
#define bM0P_UID_UIDR2_UID6                             *((volatile unsigned int*)(0x42004118UL))
#define bM0P_UID_UIDR2_UID7                             *((volatile unsigned int*)(0x4200411CUL))
#define bM0P_UID_UIDR2_UID8                             *((volatile unsigned int*)(0x42004120UL))
#define bM0P_UID_UIDR2_UID9                             *((volatile unsigned int*)(0x42004124UL))
#define bM0P_UID_UIDR2_UID10                            *((volatile unsigned int*)(0x42004128UL))
#define bM0P_UID_UIDR2_UID11                            *((volatile unsigned int*)(0x4200412CUL))
#define bM0P_UID_UIDR2_UID12                            *((volatile unsigned int*)(0x42004130UL))
#define bM0P_UID_UIDR2_UID13                            *((volatile unsigned int*)(0x42004134UL))
#define bM0P_UID_UIDR2_UID14                            *((volatile unsigned int*)(0x42004138UL))
#define bM0P_UID_UIDR2_UID15                            *((volatile unsigned int*)(0x4200413CUL))
#define bM0P_VC_VC_CTL1_VC_EN                           *((volatile unsigned int*)(0x42786000UL))
#define bM0P_VC_VC_CTL1_VC_OUT                          *((volatile unsigned int*)(0x42786004UL))
#define bM0P_VC_VC_CTL1_VC_NMODE                        *((volatile unsigned int*)(0x42786008UL))
#define bM0P_VC_VC_CTL1_VC_COMPSL0                      *((volatile unsigned int*)(0x4278600CUL))
#define bM0P_VC_VC_CTL1_VC_COMPSL1                      *((volatile unsigned int*)(0x42786010UL))
#define bM0P_VC_VC_CTL2_VC_FILTER_EN                    *((volatile unsigned int*)(0x42786080UL))
#define bM0P_VC_VC_CTL2_VC_RESPONSE0                    *((volatile unsigned int*)(0x42786084UL))
#define bM0P_VC_VC_CTL2_VC_RESPONSE1                    *((volatile unsigned int*)(0x42786088UL))
#define bM0P_VC_VC_CTL2_VC_RESPONSE2                    *((volatile unsigned int*)(0x4278608CUL))
#define bM0P_VC_VC_CTL2_VCINT_EDGE0                     *((volatile unsigned int*)(0x42786094UL))
#define bM0P_VC_VC_CTL2_VCINT_EDGE1                     *((volatile unsigned int*)(0x42786098UL))
#define bM0P_VC_VC_CTL2_VCINT_HIGH                      *((volatile unsigned int*)(0x4278609CUL))
#define bM0P_VC_VC_CTL2_VC2PT                           *((volatile unsigned int*)(0x427860A0UL))
#define bM0P_VC_VC_CTL2_VCIE                            *((volatile unsigned int*)(0x427860A4UL))
#define bM0P_VC_VC_CTL2_VCIF                            *((volatile unsigned int*)(0x427860A8UL))
#define bM0P_VC_VC_CTL2_VC_HYS_SEL                      *((volatile unsigned int*)(0x427860ACUL))
#define bM0P_VC_VC_CTL3_VC_TM0G                         *((volatile unsigned int*)(0x42786100UL))
#define bM0P_VC_VC_CTL3_VC_TM2G                         *((volatile unsigned int*)(0x42786104UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR0                 *((volatile unsigned int*)(0x426A0000UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR1                 *((volatile unsigned int*)(0x426A0004UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR2                 *((volatile unsigned int*)(0x426A0008UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR3                 *((volatile unsigned int*)(0x426A000CUL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHR4                 *((volatile unsigned int*)(0x426A0010UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD0                 *((volatile unsigned int*)(0x426A0020UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD1                 *((volatile unsigned int*)(0x426A0024UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD2                 *((volatile unsigned int*)(0x426A0028UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD3                 *((volatile unsigned int*)(0x426A002CUL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SVHD4                 *((volatile unsigned int*)(0x426A0030UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_SRST                  *((volatile unsigned int*)(0x426A0040UL))
#define bM0P_WSUNIT_LVD1_SET_LVD1_EN                    *((volatile unsigned int*)(0x426A0060UL))
#define bM0P_WSUNIT_LVD_INT_STR_LVD1_IF                 *((volatile unsigned int*)(0x426A0080UL))
#define bM0P_WSUNIT_LVD_INT_STR_LVD2_IF                 *((volatile unsigned int*)(0x426A00C0UL))
#define bM0P_WSUNIT_LVD_CLR_LVD1_CLR                    *((volatile unsigned int*)(0x426A0100UL))
#define bM0P_WSUNIT_LVD_CLR_LVD2_CLR                    *((volatile unsigned int*)(0x426A0140UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR0                 *((volatile unsigned int*)(0x426A0200UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR1                 *((volatile unsigned int*)(0x426A0204UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR2                 *((volatile unsigned int*)(0x426A0208UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR3                 *((volatile unsigned int*)(0x426A020CUL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHR4                 *((volatile unsigned int*)(0x426A0210UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD0                 *((volatile unsigned int*)(0x426A0220UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD1                 *((volatile unsigned int*)(0x426A0224UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD2                 *((volatile unsigned int*)(0x426A0228UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD3                 *((volatile unsigned int*)(0x426A022CUL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SVHD4                 *((volatile unsigned int*)(0x426A0230UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_SRST                  *((volatile unsigned int*)(0x426A0240UL))
#define bM0P_WSUNIT_LVD2_SET_LVD2_EN                    *((volatile unsigned int*)(0x426A0260UL))
#define bM0P_WSUNIT_BUR01_BUR010                        *((volatile unsigned int*)(0x426AE000UL))
#define bM0P_WSUNIT_BUR01_BUR011                        *((volatile unsigned int*)(0x426AE004UL))
#define bM0P_WSUNIT_BUR01_BUR012                        *((volatile unsigned int*)(0x426AE008UL))
#define bM0P_WSUNIT_BUR01_BUR013                        *((volatile unsigned int*)(0x426AE00CUL))
#define bM0P_WSUNIT_BUR01_BUR014                        *((volatile unsigned int*)(0x426AE010UL))
#define bM0P_WSUNIT_BUR01_BUR015                        *((volatile unsigned int*)(0x426AE014UL))
#define bM0P_WSUNIT_BUR01_BUR016                        *((volatile unsigned int*)(0x426AE018UL))
#define bM0P_WSUNIT_BUR01_BUR017                        *((volatile unsigned int*)(0x426AE01CUL))
#define bM0P_WSUNIT_BUR02_BUR020                        *((volatile unsigned int*)(0x426AE020UL))
#define bM0P_WSUNIT_BUR02_BUR021                        *((volatile unsigned int*)(0x426AE024UL))
#define bM0P_WSUNIT_BUR02_BUR022                        *((volatile unsigned int*)(0x426AE028UL))
#define bM0P_WSUNIT_BUR02_BUR023                        *((volatile unsigned int*)(0x426AE02CUL))
#define bM0P_WSUNIT_BUR02_BUR024                        *((volatile unsigned int*)(0x426AE030UL))
#define bM0P_WSUNIT_BUR02_BUR025                        *((volatile unsigned int*)(0x426AE034UL))
#define bM0P_WSUNIT_BUR02_BUR026                        *((volatile unsigned int*)(0x426AE038UL))
#define bM0P_WSUNIT_BUR02_BUR027                        *((volatile unsigned int*)(0x426AE03CUL))
#define bM0P_WSUNIT_BUR03_BUR030                        *((volatile unsigned int*)(0x426AE040UL))
#define bM0P_WSUNIT_BUR03_BUR031                        *((volatile unsigned int*)(0x426AE044UL))
#define bM0P_WSUNIT_BUR03_BUR032                        *((volatile unsigned int*)(0x426AE048UL))
#define bM0P_WSUNIT_BUR03_BUR033                        *((volatile unsigned int*)(0x426AE04CUL))
#define bM0P_WSUNIT_BUR03_BUR034                        *((volatile unsigned int*)(0x426AE050UL))
#define bM0P_WSUNIT_BUR03_BUR035                        *((volatile unsigned int*)(0x426AE054UL))
#define bM0P_WSUNIT_BUR03_BUR036                        *((volatile unsigned int*)(0x426AE058UL))
#define bM0P_WSUNIT_BUR03_BUR037                        *((volatile unsigned int*)(0x426AE05CUL))
#define bM0P_WSUNIT_BUR04_BUR040                        *((volatile unsigned int*)(0x426AE060UL))
#define bM0P_WSUNIT_BUR04_BUR041                        *((volatile unsigned int*)(0x426AE064UL))
#define bM0P_WSUNIT_BUR04_BUR042                        *((volatile unsigned int*)(0x426AE068UL))
