wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/hc32f_m14x.h
#define bM0P_WSUNIT_BUR04_BUR043                        *((volatile unsigned int*)(0x426AE06CUL))
#define bM0P_WSUNIT_BUR04_BUR044                        *((volatile unsigned int*)(0x426AE070UL))
#define bM0P_WSUNIT_BUR04_BUR045                        *((volatile unsigned int*)(0x426AE074UL))
#define bM0P_WSUNIT_BUR04_BUR046                        *((volatile unsigned int*)(0x426AE078UL))
#define bM0P_WSUNIT_BUR04_BUR047                        *((volatile unsigned int*)(0x426AE07CUL))
#define bM0P_WSUNIT_BUR05_BUR050                        *((volatile unsigned int*)(0x426AE080UL))
#define bM0P_WSUNIT_BUR05_BUR051                        *((volatile unsigned int*)(0x426AE084UL))
#define bM0P_WSUNIT_BUR05_BUR052                        *((volatile unsigned int*)(0x426AE088UL))
#define bM0P_WSUNIT_BUR05_BUR053                        *((volatile unsigned int*)(0x426AE08CUL))
#define bM0P_WSUNIT_BUR05_BUR054                        *((volatile unsigned int*)(0x426AE090UL))
#define bM0P_WSUNIT_BUR05_BUR055                        *((volatile unsigned int*)(0x426AE094UL))
#define bM0P_WSUNIT_BUR05_BUR056                        *((volatile unsigned int*)(0x426AE098UL))
#define bM0P_WSUNIT_BUR05_BUR057                        *((volatile unsigned int*)(0x426AE09CUL))
#define bM0P_WSUNIT_BUR06_BUR060                        *((volatile unsigned int*)(0x426AE0A0UL))
#define bM0P_WSUNIT_BUR06_BUR061                        *((volatile unsigned int*)(0x426AE0A4UL))
#define bM0P_WSUNIT_BUR06_BUR062                        *((volatile unsigned int*)(0x426AE0A8UL))
#define bM0P_WSUNIT_BUR06_BUR063                        *((volatile unsigned int*)(0x426AE0ACUL))
#define bM0P_WSUNIT_BUR06_BUR064                        *((volatile unsigned int*)(0x426AE0B0UL))
#define bM0P_WSUNIT_BUR06_BUR065                        *((volatile unsigned int*)(0x426AE0B4UL))
#define bM0P_WSUNIT_BUR06_BUR066                        *((volatile unsigned int*)(0x426AE0B8UL))
#define bM0P_WSUNIT_BUR06_BUR067                        *((volatile unsigned int*)(0x426AE0BCUL))
#define bM0P_WSUNIT_BUR07_BUR070                        *((volatile unsigned int*)(0x426AE0C0UL))
#define bM0P_WSUNIT_BUR07_BUR071                        *((volatile unsigned int*)(0x426AE0C4UL))
#define bM0P_WSUNIT_BUR07_BUR072                        *((volatile unsigned int*)(0x426AE0C8UL))
#define bM0P_WSUNIT_BUR07_BUR073                        *((volatile unsigned int*)(0x426AE0CCUL))
#define bM0P_WSUNIT_BUR07_BUR074                        *((volatile unsigned int*)(0x426AE0D0UL))
#define bM0P_WSUNIT_BUR07_BUR075                        *((volatile unsigned int*)(0x426AE0D4UL))
#define bM0P_WSUNIT_BUR07_BUR076                        *((volatile unsigned int*)(0x426AE0D8UL))
#define bM0P_WSUNIT_BUR07_BUR077                        *((volatile unsigned int*)(0x426AE0DCUL))
#define bM0P_WSUNIT_BUR08_BUR080                        *((volatile unsigned int*)(0x426AE0E0UL))
#define bM0P_WSUNIT_BUR08_BUR081                        *((volatile unsigned int*)(0x426AE0E4UL))
#define bM0P_WSUNIT_BUR08_BUR082                        *((volatile unsigned int*)(0x426AE0E8UL))
#define bM0P_WSUNIT_BUR08_BUR083                        *((volatile unsigned int*)(0x426AE0ECUL))
#define bM0P_WSUNIT_BUR08_BUR084                        *((volatile unsigned int*)(0x426AE0F0UL))
#define bM0P_WSUNIT_BUR08_BUR085                        *((volatile unsigned int*)(0x426AE0F4UL))
#define bM0P_WSUNIT_BUR08_BUR086                        *((volatile unsigned int*)(0x426AE0F8UL))
#define bM0P_WSUNIT_BUR08_BUR087                        *((volatile unsigned int*)(0x426AE0FCUL))
#define bM0P_WSUNIT_BUR09_BUR090                        *((volatile unsigned int*)(0x426AE100UL))
#define bM0P_WSUNIT_BUR09_BUR091                        *((volatile unsigned int*)(0x426AE104UL))
#define bM0P_WSUNIT_BUR09_BUR092                        *((volatile unsigned int*)(0x426AE108UL))
#define bM0P_WSUNIT_BUR09_BUR093                        *((volatile unsigned int*)(0x426AE10CUL))
#define bM0P_WSUNIT_BUR09_BUR094                        *((volatile unsigned int*)(0x426AE110UL))
#define bM0P_WSUNIT_BUR09_BUR095                        *((volatile unsigned int*)(0x426AE114UL))
#define bM0P_WSUNIT_BUR09_BUR096                        *((volatile unsigned int*)(0x426AE118UL))
#define bM0P_WSUNIT_BUR09_BUR097                        *((volatile unsigned int*)(0x426AE11CUL))
#define bM0P_WSUNIT_BUR10_BUR100                        *((volatile unsigned int*)(0x426AE120UL))
#define bM0P_WSUNIT_BUR10_BUR101                        *((volatile unsigned int*)(0x426AE124UL))
#define bM0P_WSUNIT_BUR10_BUR102                        *((volatile unsigned int*)(0x426AE128UL))
#define bM0P_WSUNIT_BUR10_BUR103                        *((volatile unsigned int*)(0x426AE12CUL))
#define bM0P_WSUNIT_BUR10_BUR104                        *((volatile unsigned int*)(0x426AE130UL))
#define bM0P_WSUNIT_BUR10_BUR105                        *((volatile unsigned int*)(0x426AE134UL))
#define bM0P_WSUNIT_BUR10_BUR106                        *((volatile unsigned int*)(0x426AE138UL))
#define bM0P_WSUNIT_BUR10_BUR107                        *((volatile unsigned int*)(0x426AE13CUL))
#define bM0P_WSUNIT_BUR11_BUR110                        *((volatile unsigned int*)(0x426AE140UL))
#define bM0P_WSUNIT_BUR11_BUR111                        *((volatile unsigned int*)(0x426AE144UL))
#define bM0P_WSUNIT_BUR11_BUR112                        *((volatile unsigned int*)(0x426AE148UL))
#define bM0P_WSUNIT_BUR11_BUR113                        *((volatile unsigned int*)(0x426AE14CUL))
#define bM0P_WSUNIT_BUR11_BUR114                        *((volatile unsigned int*)(0x426AE150UL))
#define bM0P_WSUNIT_BUR11_BUR115                        *((volatile unsigned int*)(0x426AE154UL))
#define bM0P_WSUNIT_BUR11_BUR116                        *((volatile unsigned int*)(0x426AE158UL))
#define bM0P_WSUNIT_BUR11_BUR117                        *((volatile unsigned int*)(0x426AE15CUL))
#define bM0P_WSUNIT_BUR12_BUR120                        *((volatile unsigned int*)(0x426AE160UL))
#define bM0P_WSUNIT_BUR12_BUR121                        *((volatile unsigned int*)(0x426AE164UL))
#define bM0P_WSUNIT_BUR12_BUR122                        *((volatile unsigned int*)(0x426AE168UL))
#define bM0P_WSUNIT_BUR12_BUR123                        *((volatile unsigned int*)(0x426AE16CUL))
#define bM0P_WSUNIT_BUR12_BUR124                        *((volatile unsigned int*)(0x426AE170UL))
#define bM0P_WSUNIT_BUR12_BUR125                        *((volatile unsigned int*)(0x426AE174UL))
#define bM0P_WSUNIT_BUR12_BUR126                        *((volatile unsigned int*)(0x426AE178UL))
#define bM0P_WSUNIT_BUR12_BUR127                        *((volatile unsigned int*)(0x426AE17CUL))
#define bM0P_WSUNIT_BUR13_BUR130                        *((volatile unsigned int*)(0x426AE180UL))
#define bM0P_WSUNIT_BUR13_BUR131                        *((volatile unsigned int*)(0x426AE184UL))
#define bM0P_WSUNIT_BUR13_BUR132                        *((volatile unsigned int*)(0x426AE188UL))
#define bM0P_WSUNIT_BUR13_BUR133                        *((volatile unsigned int*)(0x426AE18CUL))
#define bM0P_WSUNIT_BUR13_BUR134                        *((volatile unsigned int*)(0x426AE190UL))
#define bM0P_WSUNIT_BUR13_BUR135                        *((volatile unsigned int*)(0x426AE194UL))
#define bM0P_WSUNIT_BUR13_BUR136                        *((volatile unsigned int*)(0x426AE198UL))
#define bM0P_WSUNIT_BUR13_BUR137                        *((volatile unsigned int*)(0x426AE19CUL))
#define bM0P_WSUNIT_BUR14_BUR140                        *((volatile unsigned int*)(0x426AE1A0UL))
#define bM0P_WSUNIT_BUR14_BUR141                        *((volatile unsigned int*)(0x426AE1A4UL))
#define bM0P_WSUNIT_BUR14_BUR142                        *((volatile unsigned int*)(0x426AE1A8UL))
#define bM0P_WSUNIT_BUR14_BUR143                        *((volatile unsigned int*)(0x426AE1ACUL))
#define bM0P_WSUNIT_BUR14_BUR144                        *((volatile unsigned int*)(0x426AE1B0UL))
#define bM0P_WSUNIT_BUR14_BUR145                        *((volatile unsigned int*)(0x426AE1B4UL))
#define bM0P_WSUNIT_BUR14_BUR146                        *((volatile unsigned int*)(0x426AE1B8UL))
#define bM0P_WSUNIT_BUR14_BUR147                        *((volatile unsigned int*)(0x426AE1BCUL))
#define bM0P_WSUNIT_BUR15_BUR150                        *((volatile unsigned int*)(0x426AE1C0UL))
#define bM0P_WSUNIT_BUR15_BUR151                        *((volatile unsigned int*)(0x426AE1C4UL))
#define bM0P_WSUNIT_BUR15_BUR152                        *((volatile unsigned int*)(0x426AE1C8UL))
#define bM0P_WSUNIT_BUR15_BUR153                        *((volatile unsigned int*)(0x426AE1CCUL))
#define bM0P_WSUNIT_BUR15_BUR154                        *((volatile unsigned int*)(0x426AE1D0UL))
#define bM0P_WSUNIT_BUR15_BUR155                        *((volatile unsigned int*)(0x426AE1D4UL))
#define bM0P_WSUNIT_BUR15_BUR156                        *((volatile unsigned int*)(0x426AE1D8UL))
#define bM0P_WSUNIT_BUR15_BUR157                        *((volatile unsigned int*)(0x426AE1DCUL))
#define bM0P_WSUNIT_BUR16_BUR160                        *((volatile unsigned int*)(0x426AE1E0UL))
#define bM0P_WSUNIT_BUR16_BUR161                        *((volatile unsigned int*)(0x426AE1E4UL))
#define bM0P_WSUNIT_BUR16_BUR162                        *((volatile unsigned int*)(0x426AE1E8UL))
#define bM0P_WSUNIT_BUR16_BUR163                        *((volatile unsigned int*)(0x426AE1ECUL))
#define bM0P_WSUNIT_BUR16_BUR164                        *((volatile unsigned int*)(0x426AE1F0UL))
#define bM0P_WSUNIT_BUR16_BUR165                        *((volatile unsigned int*)(0x426AE1F4UL))
#define bM0P_WSUNIT_BUR16_BUR166                        *((volatile unsigned int*)(0x426AE1F8UL))
#define bM0P_WSUNIT_BUR16_BUR167                        *((volatile unsigned int*)(0x426AE1FCUL))


#ifdef __cplusplus
}
#endif

#endif /* __HC32F_M14X_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

